{
  "@odata.type": "#microsoft.graph.macOSPkgApp",
  "description": "Installs Sourcetree_4.2.7_263.pkg",
  "developer": "Atlassian",
  "displayName": "MAC Sourcetree",
  "fileName": "Sourcetree_4.2.7_263.pkg",
  "ignoreVersionDetection": false,
  "includedApps": [
    {
      "bundleId": "com.torusknot.SourceTreeNotMAS",
      "bundleVersion": "263.0.0.0"
    }
  ],
  "informationUrl": "https://www.sourcetreeapp.com/",
  "isFeatured": false,
  "largeIcon": {
    "type": "image/png",
    "value": "",
    "@odata.type": "#Microsoft.Graph.mimeContent"
  },
  "minimumSupportedOperatingSystem": {
    "v10_10": false,
    "v10_11": false,
    "v10_12": false,
    "v10_13": false,
    "v10_14": false,
    "v10_15": true,
    "v10_7": false,
    "v10_8": false,
    "v10_9": false,
    "v11_0": false,
    "v12_0": false,
    "v13_0": false,
    "v14_0": false
  },
  "notes": "",
  "owner": "",
  "primaryBundleId": "com.torusknot.SourceTreeNotMAS",
  "primaryBundleVersion": "263.0.0.0",
  "privacyInformationUrl": "https://www.atlassian.com/legal/privacy-policy",
  "publisher": "Atlassian",
  "roleScopeTagIds": [],
  "displayVersion": null
}
