[{
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Adobe Acrobat Reader für PDF",
        "description": "Mit Adobe Acrobat Reader Dokumente direkt von deinem Gerät ausdrucken.",
        "publisher": "Adobe",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.adobe.reader\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.adobe.reader",
        "appIdentifier": "com.adobe.reader",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.adobe.reader\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Alertswiss",
        "description": "Bundesamt für Bevölkerungsschutz (BABS)",
        "publisher": "Bundesamt für Bevölkerungsschutz",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=ch.admin.babs.alertswiss\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "ch.admin.babs.alertswiss",
        "appIdentifier": "ch.admin.babs.alertswiss",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=ch.admin.babs.alertswiss\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Azure Information Protection",
        "description": "Sicher mit anderen zusammenzuarbeiten, indem Sie und die gemeinsame Nutzung von geschützten Dateien.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.ipviewer\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.ipviewer",
        "appIdentifier": "com.microsoft.ipviewer",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.ipviewer\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "HP Smart",
        "description": "HP Drucker einrichten, freigeben und verwalten sowie damit scannen und drucken",
        "publisher": "HP Inc.",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.hp.printercontrol\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.hp.printercontrol",
        "appIdentifier": "com.hp.printercontrol",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.hp.printercontrol\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "KeePassDroid",
        "description": "KeePass for your phone",
        "publisher": "Brian Pellin",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.android.keepass\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.android.keepass",
        "appIdentifier": "com.android.keepass",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.android.keepass\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Authenticator",
        "description": "Verwenden Sie Microsoft Authenticator für eine einfache und sichere Anmeldung.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.azure.authenticator\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.azure.authenticator",
        "appIdentifier": "com.azure.authenticator",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.azure.authenticator\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Edge: Mit KI browsen",
        "description": "Erstklassige Leistung, bessere Privatsphäre, höhere Produktivität, mehr Wert.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.emmx\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.emmx",
        "appIdentifier": "com.microsoft.emmx",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.emmx\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Excel: Spreadsheets",
        "description": "Aussagekräftige Tabellen erstellen. Dokumente unterwegs komfortabel bearbeiten.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.excel\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.office.excel",
        "appIdentifier": "com.microsoft.office.excel",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.excel\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Launcher",
        "description": "Personalisieren Sie Ihr Smartphone und behalten Sie unterwegs alles im Blick.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.launcher\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.launcher",
        "appIdentifier": "com.microsoft.launcher",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.launcher\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft OneDrive",
        "description": "Kostenlos von überall auf Fotos, Dokumente und mehr zugreifen und sie teilen.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.skydrive\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.skydrive",
        "appIdentifier": "com.microsoft.skydrive",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.skydrive\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft OneNote: Save Notes",
        "description": "Leistungsstarker Notizblock zum Erfassen von Ideen.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.onenote\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.office.onenote",
        "appIdentifier": "com.microsoft.office.onenote",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.onenote\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Outlook",
        "description": "Die offizielle App von Microsoft Outlook für Android-Handys und Tablets.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.outlook\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.office.outlook",
        "appIdentifier": "com.microsoft.office.outlook",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.outlook\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Planner",
        "description": "Für diese App ist ein passendes gewerbliches Office 365-Abonnement erforderlich.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.planner\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.planner",
        "appIdentifier": "com.microsoft.planner",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.planner\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Power BI - Geschäftsdatenanalyse",
        "description": "Ihre Daten sind jederzeit griffbereit - ganz gleich, wo Sie gerade sind.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.powerbim\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.powerbim",
        "appIdentifier": "com.microsoft.powerbim",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.powerbim\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft PowerPoint: Präsentationsfolien",
        "description": "Die echte Microsoft PowerPoint-App für Android-Smartphones und Tablets.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.powerpoint\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.office.powerpoint",
        "appIdentifier": "com.microsoft.office.powerpoint",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.powerpoint\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft SharePoint",
        "description": "Mit SharePoint-Websites, -Neuigkeiten, -Personen und -Dateien verbunden bleiben",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.sharepoint\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.sharepoint",
        "appIdentifier": "com.microsoft.sharepoint",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.sharepoint\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft SwiftKey KI-Tastatur",
        "description": "Die beste Tastatur mit Text-Vorhersagen – Android Central",
        "publisher": "SwiftKey",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.touchtype.swiftkey\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.touchtype.swiftkey",
        "appIdentifier": "com.touchtype.swiftkey",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.touchtype.swiftkey\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Teams",
        "description": "Microsoft Teams ist Ihr Hub für Teamwork in Office 365.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.teams\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.teams",
        "appIdentifier": "com.microsoft.teams",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.teams\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft To Do: Lists & Tasks",
        "description": "Eine einfache, intelligente Aufgabenliste mit Ihrem Tag im Mittelpunkt.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.todos\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.todos",
        "appIdentifier": "com.microsoft.todos",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.todos\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Übersetzer",
        "description": "Übersetzen Sie Text, Sprache, Bilder und Konversationen in über 70 Sprachen",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.translator\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.translator",
        "appIdentifier": "com.microsoft.translator",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.translator\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Untern.-Portal",
        "description": "Microsoft Intune Untern.-Portal",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.windowsintune.companyportal\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.windowsintune.companyportal",
        "appIdentifier": "com.microsoft.windowsintune.companyportal",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.windowsintune.companyportal\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Microsoft Word: Dokumente verfassen und bearbeiten",
        "description": "App zum mobilen Schreiben. Mit Office Dokumente leicht erstellen und bearbeiten.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.word\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.office.word",
        "appIdentifier": "com.microsoft.office.word",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.word\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Power Apps",
        "description": "Business in App-Geschwindigkeit",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.msapps\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.msapps",
        "appIdentifier": "com.microsoft.msapps",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.msapps\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Power Automate—Business workflow automation",
        "description": "Erstellen Sie automatisierte Workflows Benachrichtigungen zu erhalten, synchronisieren Dateien und vieles mehr.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.flow\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.flow",
        "appIdentifier": "com.microsoft.flow",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.flow\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Remote Desktop",
        "description": "Mit Microsoft Remote Desktop können Sie eine Verbindung zu Remote-PCs und virtuellen Apps herstellen.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.rdc.androidx\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.rdc.androidx",
        "appIdentifier": "com.microsoft.rdc.androidx",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.rdc.androidx\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "Surface Audio",
        "description": "Aktualisieren Sie Surface Earbuds und Surface Headphones und passen Sie die Einstellungen an.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.surfaceaudio\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.microsoft.surfaceaudio",
        "appIdentifier": "com.microsoft.surfaceaudio",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.surfaceaudio\u0026hl=de-CH",
        "appTracks": []
    }, {
        "@odata.type": "#microsoft.graph.androidManagedStoreApp",
        "displayName": "WhatsApp Messenger",
        "description": "Einfach. Persönlich. Sicher.",
        "publisher": "WhatsApp Inc.",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": null,
        "informationUrl": "https://play.google.com/store/apps/details?id=com.whatsapp\u0026hl=de-CH",
        "owner": null,
        "developer": null,
        "notes": null,
        "roleScopeTagIds": [],
        "packageId": "com.whatsapp",
        "appIdentifier": "com.whatsapp",
        "appStoreUrl": "https://play.google.com/store/apps/details?id=com.whatsapp\u0026hl=de-CH",
        "appTracks": []
    }
]
