[{
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Adobe Acrobat Reader for PDF",
        "description": "The free Adobe Acrobat Reader PDF app is trusted by millions of people around the world.\n \nAdobe Acrobat Reader is the free global standard for reliably viewing, signing, and commenting on PDF documents.\n \nVIEW PDFs\n• Quickly open and view PDF documents.\n• Search, scroll, and zoom in and out.\n• Choose Single Page or Continuous scroll mode.\n \nANNOTATE PDFs\n• Comment on PDFs using sticky notes and drawing tools.\n• Highlight and mark up text with annotation tools.\n• View and respond to annotations in the comments list.\n• Use Apple Pencil with iPad Pro for exceptional commenting precision.\n \nWORK WITH OTHERS AND SHARE PDFs\n• Quickly access documents shared for viewing, review, or signature.\n• Collaborate with others by adding your comments to PDFs sent to you for review. \n• Receive activity notifications for files you’ve shared for viewing and review.\n• Track pending actions on documents shared with you.\n• Easily share PDFs with others by creating links you can send by email.\n \nWORK WITH SCANNED DOCUMENTS\n• Easily access scanned PDFs that you’ve captured using the free Adobe Scan app.\n• Open your scans in Acrobat Reader to fill in, sign, review, and share.\n \nFILL AND SIGN FORMS\n• Quickly fill out PDF forms by typing text into fields.\n• Use your finger or Apple Pencil to e-sign any PDF document.\n \nSTORE, ACCESS, AND PRINT FILES\n• Sign in to your free Adobe Document Cloud account to store and access files across devices.\n• Star files to keep important documents at your fingertips.\n• Connect to your Dropbox account and access other storage providers including iCloud Drive, Box, Microsoft OneDrive, and Google Drive.\n• Print documents from your device.\n \nDARK MODE\nSwitch to dark mode in iOS 13 and change the background color of the app window. This is not only easy on the eye in low light, but may also prolong the battery life of your device.\n\nCONNECT TO GOOGLE DRIVE\n• Access PDFs and other files stored on your Google Drive with ease.\n• Create, view, edit, combine, compress, export, share, and star Google Drive files directly in Acrobat Reader.\n \nIN-APP PURCHASE\nSubscribe for even more PDF power. Subscriptions work across mobile and web.\n• Organize and edit PDFs.\n• Create PDF files from documents or images.\n• Export PDFs to Microsoft Word, Excel, or PowerPoint.\n• Compress PDFs to reduce file size.\n• Combine files into one PDF.\n\nIN-APP PURCHASE DETAILS\n• Payment will be charged to your iTunes account at confirmation of purchase.\n• Subscriptions automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period.\n \nAdobe Acrobat Reader is a Microsoft Intune supported partner app and accommodates multiple identities. \n \nTerms \u0026 Conditions: Your use of this application is governed by the Adobe General Terms of Use (https://adobe.com/go/terms_linkfree_en and the Adobe Privacy Policy (http://www.adobe.com/go/privacy_policy_linkfree_en).\n\nDo Not Sell My Information: https://www.adobe.com/privacy/ca-rights-linkfree.html",
        "publisher": "Adobe Inc.",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.adobe.Adobe-Reader",
        "appStoreUrl": "https://apps.apple.com/us/app/adobe-acrobat-reader-for-pdf/id469337564?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Alertswiss",
        "description": "The Alertswiss blog features all the latest civil protection-related news, including information on recent deployments, drills and personnel, as well as up-to-the-minute policy and planning developments. \n\nIn an emergency, you may find yourself confronted with questions you have never asked yourself before: How do I contact my friends and relatives? Where should I go? What do I need to take with me? An emergency plan will help you Disaster can strike at any time. Luckily, there is Alertswiss, a mobile app developed by the Federal Office for Civil Protection to help you plan for and stay safe in an emergency. With Alertswiss, you receive alerts, warnings and information in real time. So that you always know exactly and immediately what action you need to take, the Alertswiss app sends you push notifications on the incident, including valuable tips and instructions on how best to protect yourself and your family. \n\nThe app also lets you customise the type of information you receive: for example, specifying the cantons that you want to receive notifications for, e.g. cantons where your relatives or friends live. All of these reports will be displayed directly on your smartphone’s homescreen. As well as receiving push notifications for your preferred cantons, you can enable push notifications for your current location. However, you first have to authorise the Alertswiss app to determine your location. Once you have activated the location services, all reports and information for both your current location and your preferred cantons will be displayed directly on your smartphone’s homescreen. \nMaps show simply and clearly which areas are currently affected by the ongoing incident. On the overview screen, you can see which incidents are still ongoing and which ones have since been given the all-clear. \n\nUnder Reports you will find an overview of the latest official incident information released in Switzerland and Liechtenstein. These reports – alerts, warnings and information – are divided into three levels of severity, with alerts being the highest and information the lowest. \n\n- An alert is when the authorities notify the public that they are at immediate risk and order them to follow official instructions on the behaviour they need to adopt. \n- A warning refers to the reporting of either a potential risk to the public or an incident for which the authorities issue the public with recommendations rather than orders on the behaviour they should subsequently adopt. \n- The default level of severity for all other reports is Information.\n\nTake swift and appropriate action should a hazardous situation arise. \nSo, what are you waiting for? Download the Alertswiss app now and be prepared should disaster strike. Stay safe! \n\nNote: \nYour smartphone must have a stable data connection (WLAN or mobile network) to receive the latest push notifications and incident reports. If you are offline, you will only be able to view information that was updated the last time you were online. Once the connection is re-established, the system will update automatically and send you all of the latest push notifications and reports.",
        "publisher": "Swiss Federal Office for Civil Protection (FOCP)",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "ch.admin.babs.alertswiss",
        "appStoreUrl": "https://apps.apple.com/us/app/alertswiss/id957339177?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Azure Information Protection",
        "description": "Azure Information Protection app enables you to securely collaborate with others. You can view protected files (Rights protected email messages, PDF files, pictures, text files, and any other file format that is protected as a .pfile) that others have shared with you.\n\nIT administrators can also deploy and manage the app for devices that are enrolled by Intune.\n\nFor more details, read our FAQ page http://go.microsoft.com/fwlink/?LinkId=828412\n\nNOTE: You need to have an Office 365 account to use Microsoft Azure Information Protection viewer application. You can sign up for a free account by using the Azure Information Protection page. You cannot use Microsoft Account (Live, Hotmail or Outlook.com) account to sign in.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.rms-sharing",
        "appStoreUrl": "https://apps.apple.com/us/app/azure-information-protection/id689516635?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS HP Smart",
        "description": "Print, scan, and share files by using HP Smart with your HP Printer. HP Smart makes it easy to get started and keeps you going with features like Print Anywhere or Mobile Fax!\n \n\n· Start with a hassle-free set up, then print, scan, copy, and share files directly from your mobile device to your friends, co-workers, or a linked cloud account \n· Manage or print to your printer using any network connection\n· Order supplies, get support, and manage your HP account straight from the app\n· Create high-quality scans with your mobile device’s camera or import existing files, then preview, edit, and save them as PDFs and JPEGs or send them in your favorite cloud storage account\n· Edit and enhance your photos by adding filters and text, cropping, and adjusting the saturation, contrast, or brightness \n· It’s easy to send secure faxes from the app with Mobile Fax\n· Be more productive with Smart Tasks—customizable one-touch shortcuts\n· Access hundreds of printable crafts, cards, and learning activities for free with Printables! Get involved and get your family creating together!\n \nSome HP Smart features require a network connection and an HP account for full functionality. Certain features/software are available in English language only. For a full list of supported printers, visit: http://support.hp.com/us-en/document/c03722645?openCLC=true",
        "publisher": "HP Inc.",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.hp.printer.control",
        "appStoreUrl": "https://apps.apple.com/us/app/hp-smart/id469284907?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Intune-Unternehmensportal",
        "description": "Mit Microsoft Intune können Organisationen Ihren Zugriff auf Unternehmens-Apps, Daten und Ressourcen verwalten. Unternehmensportal ist die App, mit der Sie als Mitarbeiter Ihres Unternehmens, sicher auf diese Ressourcen zugreifen können. \n\nBevor Sie diese App verwenden können, stellen Sie sicher, dass Ihr IT-Administrator Ihr Geschäftskonto eingerichtet hat. Ihr Unternehmen muss auch über ein Abonnement für Microsoft Intune verfügen. \n\nUnternehmensportal vereinfacht die Aufgaben, die Sie für die Arbeit benötigen: \n\n• Registrieren Sie Ihr Gerät, um auf Unternehmensressourcen zuzugreifen, einschließlich Office, E-Mail und OneDrive for Business\n• Setzen Sie das Kennwort Ihres Geschäftskontos schnell zurück, wenn Sie es vergessen\n• Finden Sie Apps, die Ihnen bei Ihren täglichen Aufgaben helfen, die Sie von Ihrem Unternehmen erhalten haben\n• Zeigen Sie all Ihre registrierten Geräte an, und verwalten Sie sie – und setzen Sie sie selbst zurück, falls sie verloren gehen oder gestohlen werden\n• Erhalten Sie Hilfe von Ihrer IT-Abteilung, deren Kontaktinformationen einfach zu finden sind\n\nEin Hinweis zu Intune: jede Organisation verfügt über unterschiedliche Zugriffsbedingungen und verwendet Intune so, wie sie es für die beste Lösung zum Verwalten ihrer Informationen hält. Einige Funktionen sind womöglich in bestimmten Ländern nicht verfügbar. Wenn Sie fragen darüber haben, wie diese App innerhalb Ihrer Organisation verwendet wird, hat Ihr IT-Administrator bestimmt die Antworten für Sie parat. Microsoft, Ihr Netzwerkanbieter und der Hersteller Ihres Geräts wissen nicht, wie Intune von Ihrer Organisation verwendet wird.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.CompanyPortal",
        "appStoreUrl": "https://apps.apple.com/ch/app/intune-unternehmensportal/id719171358?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Authenticator",
        "description": "Sign in is easy, convenient, and secure when you use Microsoft Authenticator. Use your phone, not your password, to log into your Microsoft account. You simply have to enter your username, then approve the notification sent to your phone. Your fingerprint, face ID, or PIN will provide a second layer of security in this two step verification process. After, you\u0027ll have access to all your Microsoft products and services, such as Outlook, OneDrive, Office, and more.\n\nMicrosoft Authenticator also supports multi factor authentication for work, school, and non-Microsoft accounts. The app provides a second layer of security after your password. When logging in, you\u0027ll enter your password, and then you\u0027ll be asked for an additional way to prove it\u0027s really you. Either approve the notification sent to the Microsoft Authenticator, or enter the verification code generated by the app.  \n\nSometimes your work or school might ask you to install the Microsoft Authenticator when accessing certain files, emails, or apps. You will need to register your device to your organization through the app and add your work or school account. Microsoft Authenticator also supports cert-based authentication by issuing a certificate on your device. This will let your organization know that the sign-in request is coming from a trusted device and help you seamlessly and securely access additional Microsoft apps and services without needing to log into each. Because Microsoft Authenticator supports single sign-on, once you have proven your identity once, you will not need to log in again to other Microsoft apps on your device.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.azureauthenticator",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-authenticator/id983156458?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "ïOS Microsoft Edge",
        "description": "Introducing the new Microsoft Edge. It’s time to expect more. More privacy. More control. More productivity. More value. Browse anywhere with one continuous experience from your phone to your computer and other signed-in devices. Microsoft Edge gives you the tools to protect your privacy online with features like tracking prevention, AdBlock Plus, and InPrivate browsing. Organize the web in a way that cuts through the clutter, making it easier to find, view, and manage your content on the go. With world class compatibility, performance, and new features, the new Microsoft Edge is the only browser you’ll ever need. \n\nThe new Microsoft Edge features: \n\nA more personalized browsing experience\n•\tYour favorites, passwords, Collections, and other saved data are securely synced across your devices.\n\nTake control of your data\n•\tNew! Tracking prevention blocks trackers from sites you haven’t visited. This is enabled by default, so you don’t have to take any action to start having a more private browsing experience. \n\nCollect and organize on the go \n•\tNew! Collections makes it easier than ever to collect and organize content you find on the web across your signed-in devices – now available on your mobile device.\n\nBrowse InPrivate\n•\tWhen you use InPrivate tabs, your browsing data (like cookies, history, autofill information, or temporary files) isn\u0027t saved on your device after you close out of an InPrivate tab. \n  \nBlock Ads\n• AdBlock Plus helps block unwanted ads.  \n• Turn on ad blocking by visiting Settings \u003e Content blockers.\n\nMicrosoft Rewards\n•\tEarn rewards while you search with Bing and find shopping deals online and in nearby stores.*\n\nRedesigned navigation helps you get to your Favorites, Reading list, and more in fewer taps. \n\n*This shopping feature currently is only available in the United States.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.msedge",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-edge/id1288723196?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Excel",
        "description": "Microsoft Excel, the spreadsheet app, lets you create, view, edit, and share your files quickly and easily. Manage spreadsheets, tables and workbooks attached to email messages from your phone with this powerful productivity app.\n\nWork in data analysis, accounting, auditing, or other fields confidently with anyone, anywhere. Quickly graph the most complex formulas, charts and tables with amazing features.\n\nReview spreadsheets and run data analysis on the go. Customize tables and spreadsheets the way you want with robust formatting tools and great features. The productivity app lets you build your spreadsheet to meet your specific needs.\n\nGet the complete Microsoft Office experience when you sign in with your Microsoft 365 subscription. Create templates, edit spreadsheets, organize charts and share with ease when you download Microsoft Excel.\n\nTables \u0026 Spreadsheets: Create, Calculate and Analyze\n• Jump-start your budget, task list, accounting, or financial analysis with Excel’s modern templates.\n• Quickly graph with familiar formulas to run calculations and analyze your data.\n• Rich productivity features and formatting options make your workbook easier to read and use.\n• Use Cards View to easily see and manage spreadsheets.\n\nProductivity App: Review, Edit, and Work Anywhere\n• Review your Excel files from any device.\n• Edit sheets and data or update your task list from anywhere.\n• Spreadsheet features like sort and filter columns help focus your reviews.\n• Create, duplicate, hide, and unhide sheets easily.\n\nData Analysis\n• Analyze data using common charts and graphs.\n• Use spreadsheet features like add and edit chart labels to highlight key insights in your data.\n• Pie chart maker: create charts and graphs from your data.\n\nFinance: Budgeting \u0026 Accounting\n• Use agile spreadsheets and charts to help manage budgets.\n• Familiar tools to help you drill down to your exact finance needs.\n• Calculate tax estimates, personal finances and more.\n\nDraw and Annotate with Ink\n• Make notes, highlight your worksheet, create shapes, or write equations using the draw tab feature in Excel on devices with touch capabilities.\n\nSharing made easy\n• Share your files with a few taps to quickly invite others to edit, view, or leave comments directly in your workbooks.\n• Copy the content of your worksheet in the body of an email message with its format intact or attach or copy a link to your workbook for other sharing options.\n\nDownload Microsoft Excel and get the best way to create, organize and manage data and spreadsheets from your iPhone or iPad.\n\nTo create or edit documents, sign in with a free Microsoft account on devices with a screen size smaller than 10.1 inches.\nUnlock the full Microsoft Office experience with a qualifying Microsoft 365 subscription for your phone, tablet, PC, and Mac.\n\nMonthly Microsoft 365 subscriptions purchased from the app will be charged to your App Store account and will automatically renew within 24 hours prior to the end of the current subscription period unless auto-renewal is disabled beforehand. You can manage your subscriptions in your App Store account settings.\n\nThis app is provided by either Microsoft or a third-party app publisher and is subject to a separate privacy statement and terms and conditions. Data provided through the use of this store and this app may be accessible to Microsoft or the third-party app publisher, as applicable, and transferred to, stored, and processed in the United States or any other country where Microsoft or the app publisher and their affiliates or service providers maintain facilities.\n\n\nPlease refer to the Microsoft Software License Terms for Microsoft 365. See “License Agreement” link under Information. By installing the app, you agree to these terms and conditions.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.Office.Excel",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-excel/id586683407?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft OneDrive",
        "description": "Microsoft OneDrive keeps your photos and files backed up, protected, synced, and accessible on all your devices. The OneDrive app lets you view and share OneDrive files, documents, photos, and videos with friends and family. You can use the app to automatically back up your phone\u0027s photos and videos. Start with 5 GB of free cloud storage or upgrade to a Microsoft 365 subscription to get 1 TB of storage.\n\nMicrosoft OneDrive offers the following features:\n\nBack up photos and videos\n• Automatic photo and video backup when you turn on Camera Upload\n• View photos on your phone, computer, and online\n\nFile sharing and management\n• Share docs, photos, videos, and albums with friends and family\n• Get notifications when a shared document is edited\n• Set password-protected or expiring sharing links*\n• Access entire folders on the app without being online*\n\nScan\n• Scan documents, business cards, receipts, whiteboards, and more\n• Mark up, sign, and send docs right from the OneDrive mobile app\n\nSearch\n• Search docs by name or content\n\nSecurity\n• Personal Vault lets you protect your important files with identity verification\n• Restore documents with version history on all files\n• Ransomware detection and recovery*\n\nWorks with Microsoft Word, Excel, PowerPoint, OneNote, Outlook\n•  Back up, view, and save your Office documents.\n•  Use Microsoft Office apps to edit and collaborate in real time on Word, Excel, PowerPoint, and OneNote files stored in OneDrive.\n\nUpgrade to a Microsoft 365 subscription\nWith a Microsoft 365 Personal subscription you get 1TB of storage (1TB of storage per person for up to 6 people with the Family subscription), OneDrive premium features, and access to all features in Word, Excel, PowerPoint, Outlook, and OneNote on iPad, iPhone, and iPod touch, and you can install Word, Excel, PowerPoint, and Outlook on PCs or Macs.\n \nTo make an in-app purchase of a Microsoft 365 Personal or Family subscription: open the app, tap the Me tab, then tap your storage or the diamond icon.\nSubscriptions begin at $6.99 a month in the US, and can vary by region. Microsoft 365 subscriptions and OneDrive standalone subscriptions purchased from the app will be charged to your iTunes account and will automatically renew within 24 hours prior to the end of the current subscription period, unless auto-renewal is disabled beforehand.\n\nTo manage your subscriptions or to disable auto-renewal, after purchase, go to your iTunes account settings. A subscription cannot be cancelled or refunded during the active subscription period.\n \nUsing this OneDrive app for work or school\nFor you to sign into your work or school account on OneDrive, your organization needs to have a qualifying OneDrive, SharePoint Online or Microsoft 365 business subscription plan.\n\nPrivacy\nThis app is provided by Microsoft. Data provided through the use of this store and this app may be accessible to Microsoft and transferred to, stored, and processed in the United States or any other country where Microsoft or its affiliates maintain facilities.\n \nPrivacy Policy: https://go.microsoft.com/fwlink/?LinkID=507539.\nTerms of Use: https://go.microsoft.com/fwlink/p/?LinkID=246338.\n\n*Requires Microsoft 365 Personal or Family subscription",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.skydrive",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-onedrive/id477537958?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft OneNote",
        "description": "Capture your thoughts, discoveries, and ideas and simplify overwhelming planning moments in your life with your very own digital notepad.\n\nWith OneNote, you can plan that big event, seize that moment of inspiration to create something new, and track that list of errands that are too important to forget. Write memos, make a digital sketchbook and save notes right on your phone.\n\nSync your notes via OneDrive to access them anytime, anywhere. Whether you\u0027re at home, in the office, or on the go, your notes are available to you across all of your devices.\n\nGet the complete Microsoft Office experience when you sign in with your Microsoft Account. Take notes, share ideas, organize and collaborate when you download Microsoft OneNote today.\n\nCapture Anything:\n• With OneNote, you can plan that big event, save ideas to create something new and track that list of errands that are too important to forget.\n• Save pictures of whiteboards, photos or printed documents in your notes with Office Lens. Quickly take a picture, automatically crop and insert the image into your notes.\n\nOrganize, Search and Secure:\n• Quickly organize your notes in a way that works best for you with powerful organizational tools.\n• Find your most recent notes quickly and pin the pages you use most.\n• Secure your notes with a password and use touch ID to quickly access them.\n\nSync your Sticky Notes:\n• Quickly save your thoughts and ideas with colorful sticky notes on the go.\n• Sync your sticky notes to access them from anywhere on any device, anytime.\n\nSave, Share, and Collaborate:\n• Save to the cloud (OneDrive, OneDrive for Business, and SharePoint) and access your notes on anytime and on any device.\n• Collaborate and work together in a shared notepad.\n\nWrite \u0026 Draw on iPad:\n• Use a variety of pen colors and settings to create beautiful handwritten notes and drawings.\n• Draw with confidence with \"Convert to Shapes\" mode: OneNote will automatically convert hand drawn shapes into crisp, perfectly regular polygons and circles.\n• Use a stylus or the touchscreen to write notes or use OneNote as a sketchbook.\n\nOneNote is free on iPhone and many other devices. Get started today! Download OneNote and sign in with your Microsoft Account or the account assigned to you by your work or school.\n\nMonthly Microsoft 365 subscriptions purchased from the app will be charged to your App Store account and will automatically renew within 24 hours prior to the end of the current subscription period unless auto-renewal is disabled beforehand. You can manage your subscriptions in your App Store account settings.\n\nThis app is provided by either Microsoft or a third-party app publisher and is subject to a separate privacy statement and terms and conditions. Data provided through the use of this store and this app may be accessible to Microsoft or the third-party app publisher, as applicable, and transferred to, stored, and processed in the United States or any other country where Microsoft or the app publisher and their affiliates or service providers maintain facilities.\n\nPlease refer to the Microsoft Software License Terms for Microsoft 365. See “License Agreement” link under Information. By installing the app, you agree to these terms and conditions.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.onenote",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-onenote/id410395246?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Outlook",
        "description": "Outlook lets you bring all your email accounts and calendars in one convenient spot. Whether it\u0027s staying on top of your inbox or scheduling the next big thing, we make it easy to be your most productive, organized, and connected self.\n\nHere\u0027s what you\u0027ll love about Outlook for iOS:\n\n- Focus on the right things with our smart inbox - we help you sort between messages you need to act on straight away and everything else.\n\n- Swipe to quickly schedule, delete and archive messages.\n\n- Share your meeting availability with just a tap and easily find times to meet with others.\n\n- Find everything you\u0027re looking for with our new search experience, including files, contacts, and your upcoming trips.\n\n- View and attach any file from your email, OneDrive, Dropbox, and more, without having to download them to your phone.\n\n- Bring all the apps you love in Outlook, including Facebook, Evernote, Trello, and more.\n\n- Open Word, Excel, or other Office document attachments to edit them directly in the corresponding app and attach them back to an email.\n\n--\n\nOutlook for iOS works with Microsoft Exchange, Office 365, Outlook.com (including Hotmail and MSN), Gmail, Yahoo Mail, and iCloud.\n\n--\n\nTo make an in-app purchase of a Microsoft 365 Family or Personal subscription, open the app, go to Settings, and tap on Upgrade next to your Outlook.com or Hotmail.com account. Subscriptions begin at $6.99 a month in the US, and can vary by region. With a Microsoft 365 subscription, you get 1TB of storage for each user, access to all features in Word, Excel, and PowerPoint on iPad, iPhone, and iPod touch, and you can install Word, Excel, PowerPoint, Outlook and OneNote on PCs or Macs.\n\nMicrosoft 365 subscriptions purchased from the app will be charged to your iTunes account and will automatically renew within 24 hours prior to the end of the current subscription period, unless auto-renewal is disabled beforehand. To manage your subscriptions or to disable auto-renewal, after purchase, go to your iTunes account settings. A subscription cannot be cancelled during the active subscription period. Any unused portion of a free trial period, if offered will be forfeited when the user purchases a subscription to that publication, where applicable.\n\nPrivacy and Cookies: https://go.microsoft.com/fwlink/?LinkId=521839\nTerms of Use: http://go.microsoft.com/fwlink/?LinkID=530144",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.Office.Outlook",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-outlook/id951937596?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Planner",
        "description": "Microsoft Planner requires an eligible Office 365 work or school subscription.  This app does not support Office 365 personal accounts (for example: name@outlook.com or name@hotmail.com).  If you are not sure about your company’s subscription or the services you have access to, please contact your IT department.\n\nPlanner provides a simple, visual way to organize teamwork. Planner makes it easy for your team to create new plans, organize and assign tasks, share files, chat about what you’re working on, and get updates on progress.\n\n-- Organize work visually --\nEach plan has its own board, where you can organize tasks into buckets. You can categorize tasks based on their status or on whom they’re assigned to. To update the status or change assignments, just drag and drop tasks between columns.\n\n-- Visibility --\nThe My Tasks view provides a comprehensive list of all your tasks and their status across all your plans. When working together on a plan, team members always know who is working on what.\n\n-- Collaborate --\nBuilt for Office 365, Planner lets you work together on the same tasks, attach captured photos directly to them, and even have conversations around tasks without switching between apps. With Planner, all your team’s discussions and deliverables stay with the plan and don’t get locked away across disparate applications.\n\n-- Works across devices --\nPlanner works across all your devices. And with Planner, everyone is always on the same page. Continue conversations and updates tasks while on-the-go or at your desk.\n\nTerms of service: https://go.microsoft.com/fwlink/?linkid=846830\nPrivacy policy: https://go.microsoft.com/fwlink/?LinkId=521839\n\nTo learn more, please visit https://go.microsoft.com/fwlink/?linkid=849067\n\nThe Microsoft Planner app will request permission to access your photos and your camera: When you try to attach a photo to a Planner task, the app requests permission to access your Photos app in order to select images. If you choose to take a photo to attach to a Planner task, the app will request permission to access your Camera app.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.PlannerMobile",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-planner/id1219301037?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Power BI",
        "description": "Access your data from anywhere. Get notifications, annotate and share, and dive deep into your data with powerful features for decision making on the go. \n \nHighlights: \n \n• View all your important data in one place \n \n• Tap to explore, filter, and focus on what’s most important \n  \n• Easily annotate and share reports and visualizations  \n  \n• Set data alerts and get real-time notifications  \n \n• Ask questions in your own words and get meaningful insights into your data with the Q\u0026A virtual analyst \n \n• Securely access your on-premises data \n  \n• Scan barcodes and QR codes to easily track inventory and get real-world data in context \n \n• Start exploring your Power BI data instantly, with no setup needed \n \nGet the full Power BI suite and never miss a beat with  Power BI Desktop, the Power BI web service, and Power BI Mobile!",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.powerbimobile",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-power-bi/id929738808?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft PowerPoint",
        "description": "The PowerPoint app gives you access to the familiar slideshow maker tool you already know. Create, edit, view, present, or share presentations quickly and easily from anywhere.\n\nNeed to access your PowerPoint files quickly while on the go? PowerPoint provides a quick view of your recent slides and presentations for easy access on any device.\n\nWorried about multiple file versions when you work on PowerPoint mobile? Syncing is seamless across devices via OneDrive.\n\nPowerPoint lets you make a lasting impression with powerful and customizable slides and presentations that make you stand out. Create slideshows and present with confidence from anywhere.\n\nMaking a delightful and impactful presentation has never been easier. PowerPoint gives you templates to work from and automatic design ideas for your presentations.\n\nMaster your presentation with Presenter Coach, a new AI tool designed to help with public speaking. Practice your presentation and get real-time suggestions to adjust your pacing, avoid “umms” and speak confidently. Requires an active Microsoft 365 subscription.\n\nCustomize your presentations on the go, collaborating with others in real time. Sync your PowerPoint documents via OneDrive, share with coworkers and create amazing presentations as a team.\n\nGet the complete Microsoft Office experience when you sign in with your Microsoft 365 subscription. Create, edit and share presentations with ease when you download Microsoft PowerPoint today.\n\nPresent with confidence\n• Never miss a beat with PowerPoint on the go. You can make new presentations or continue working on existing ones.\n• PowerPoint syncs your presentations to OneDrive, so you can start a presentation on your PC, then edit using PowerPoint mobile.\n• A new Presenter Coach designed to provide feedback and assistance for your presentations.\n\nCustomizable Slideshow Maker\n• With the powerful and highly customizable experience in PowerPoint, creating presentations that will make an impression and help you stand out is easy.\n• Create a slideshow from a template or make a presentation from scratch.\n\nCollaborate on Presentations\n• PowerPoint makes it easy to collaborate with others.\n• With 1-click sharing, quickly invite others to edit, view, or provide feedback on your slides.\n• Easily manage permissions and see who’s working on your presentation.\n• Stay on top of changes and feedback with integrated comments within the slides.\n• Compare changes to see how your presentation has evolved over time.\n\nDownload Microsoft PowerPoint now and get the best way to create, edit and share slideshows and presentations from your iPhone or iPad.\n\nTo create or edit documents, sign in with a free Microsoft account on devices with a screen size smaller than 10.1 inches.\nUnlock the full Microsoft Office experience with a qualifying Microsoft 365 subscription for your phone, tablet, PC, and Mac.\n\nMonthly Microsoft 365 subscriptions purchased from the app will be charged to your App Store account and will automatically renew within 24 hours prior to the end of the current subscription period unless auto-renewal is disabled beforehand. You can manage your subscriptions in your App Store account settings.\n\nThis app is provided by either Microsoft or a third-party app publisher and is subject to a separate privacy statement and terms and conditions. Data provided through the use of this store and this app may be accessible to Microsoft or the third-party app publisher, as applicable, and transferred to, stored, and processed in the United States or any other country where Microsoft or the app publisher and their affiliates or service providers maintain facilities.\n\nPlease refer to the Microsoft Software License Terms for Microsoft 365. See “License Agreement” link under Information. By installing the app, you agree to these terms and conditions.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.Office.Powerpoint",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-powerpoint/id586449534?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft SharePoint",
        "description": "Find files, news, sites and people - personalized for you and your organization. SharePoint infuses AI into the mobile app experience to keep you focused and productive while on the go. AI builds an understanding of what you work on, how you work, and how your colleagues\u0027 work relates to you. When you need expertise, content, or resources when you\u0027re on the go, SharePoint is a great place to start looking.\n \n· Browse your sites, files, people and more to get back to what you were working on \n· Use search to find and discover important content\n· Access your personalized view of team sites, communication sites, and news posts \n· Tap on a user to get to their contact card and see who they work with and what they are working on\n· Create news posts on the go and share your updates, reports, status, and experiences with your team\n· Sign in to your SharePoint sites, whether they\u0027re in the cloud or on-premises.  The app works with SharePoint Online and SharePoint Server versions 2013 and higher\n· Add multiple accounts, and easily switch between them\n \nWhat people are saying: \n \nThe SharePoint mobile app has been featured in TechCrunch, The Verge, ZDNet, PCWorld and Computerworld.\n \nOver 2 years of app store reviews:\n\"making collaboration easier than ever!!\"\"\" \n\"keeps me connected with my office documents and coworkers\" \n\"seamless integration with other Office apps\" \n\"it\u0027s so easy and simple to use!!\"\n \nNote: To sign in to SharePoint, your organization needs to have an Office 365 subscription that includes SharePoint Online or an on-premises SharePoint Server.\n \nThis app is provided by Microsoft. Data provided through the use of this store and this app may be accessible to Microsoft and transferred to, stored, and processed in the United States or any other country where Microsoft or its affiliates maintain facilities.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.sharepoint",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-sharepoint/id1091505266?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft SwiftKey Keyboard",
        "description": "Microsoft SwiftKey is the intelligent keyboard that learns your writing style, so you can type faster.\n\nMicrosoft SwiftKey is always learning and adapting to match your unique way of typing - including your slang, nicknames and emojis.\n\nThat means autocorrect that actually works and helpful predictions, so you can get your point across fast, without errors.\n\nCustomise your keyboard to match your style, with dozens of themes to choose from. Send emojis, GIFs and more to your friends – Microsoft SwiftKey even learns your favourite emoji.\n\nLet Microsoft SwiftKey help you text faster with Artificial Intelligence, swipe-to-type and more! Download today.\n\nTYPE LESS, DO MORE\n\nIntelligent Keyboard\n- Microsoft SwiftKey learns from you, including your word choice, emoji usage and more\n- Swipe typing or tap-to-type, whichever you prefer\n- Toolbar: the expandable menu filled with quick shortcuts",
        "publisher": "SwiftKey",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.swiftkey.SwiftKeyApp",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-swiftkey-keyboard/id911813648?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Teams",
        "description": "Microsoft Teams is your hub for teamwork, which brings together everything a team needs: chat and threaded conversations, meetings \u0026 video conferencing, calling, content collaboration with the power of Microsoft 365 applications, and the ability to create and integrate apps and workflows that your business relies on.\n\nYou can now also use Microsoft Teams to manage your personal life - chat, make plans, share shopping lists, tasks and even your location, coordinate events with fellow club or family members and make decisions quickly. Teams provides a single hub to help you stay connected, get organized and bring balance to your entire life.\n\nEasily move between your work and personal account to stay organized throughout the day. Whether you’re sprinting towards a deadline or helping your kids with their homework, Teams can help you achieve more.\n\nConnect \u0026 Communicate\n• Chat 1-1, use group messages or dedicated channels to communicate with the entire team**\n• HD audio and video calls for scheduled face-to-face meetings from almost anywhere**\n• Mention individual team members, or the whole team at once, to get your colleagues’ attention**\n• To-do lists, calendars, and cloud storage access right in group chats\n• Personal chats, documents, \u0026 files can be securely accessed \n\nOrganize Your Whole Life\n• File sharing \u0026 editing on the go makes managing your work projects a breeze**\n• Intelligent search finds documents, spreadsheets, \u0026 photos in chats and team conversations ** \n• Custom notifications give you control to stay focus on what matters most** \n• Work calendar \u0026 personal calendar both in one app\n• Group dashboards to view important items, shared locations, \u0026 upcoming tasks within a group chat\n\nSafety \u0026 Security\n• Enterprise-level security and compliance you expect from Microsoft 365** \n• Location sharing to let colleagues, friends and family know where you are*\n• Storage in the Safe where you and your group can store, access, and share important data like passwords, frequent flier miles or your hotel reward number\n\n*Must be enabled and active\n\n**Commercial features of this app require a paid Microsoft 365 commercial subscription, or a trial subscription of Microsoft Teams for work. If you’re not sure about your company’s subscription or the services you have access to, visit Office.com/Teams to learn more or contact your IT department.\n\nBy downloading Teams, you agree to the license (see aka.ms/eulateamsmobile) and privacy terms (see aka.ms/privacy). For support or feedback, email us at mtiosapp@microsoft.com",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.skype.teams",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-teams/id1113153706?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft To Do",
        "description": "Stay organized and manage your day-to-day with Microsoft To Do. Make shopping lists or task lists, take notes, record collections, set reminders and more to improve your productivity and focus on what matters.\n\nMicrosoft To Do is the task management app that makes it easy to stay organized and manage your life. Accomplish what’s important to you each day with My Day and Suggestions, personalized day planner tools. Intelligent suggestions recommend tasks from across your lists that may be relevant each day.\n\nQuickly capture and retrieve your lists and tasks across devices by syncing reminders and tasks with Microsoft 365 to access them anywhere. For lists in personal accounts, you can collaborate with anyone with updated notifications for any changes to your to-do lists.\n\nCapture tasks from different Microsoft apps and services and sync them with Microsoft To Do, from flagging emails as tasks in Outlook to lists from Cortana. Your tasks and lists are hosted securely on the Microsoft 365 service.\n\nMake your lists unique with customizable features like emoji, colorful themes, dark mode and more. Stay connected and collaborate with friends and family by sharing lists that stay synced as changes are made.\n\nMicrosoft To Do Features:\n\nDaily planner\n• Stay focused with My Day, a personalized daily planner with suggested tasks\n• Get your lists anywhere, on any device\n• Share your list with anyone and work together \n• Add notes to any task\n\nTask manager\n• Share lists and tasks with your friends, family, colleagues, and classmates\n• Get notified when others create, complete or remove tasks in shared lists\n• Personalize your lists by choosing theme colors or backgrounds\n• Set one-time or recurring due dates and reminders\n• Break your tasks into manageable steps\n• Attach up to 25MB of files to any task\n\nTo-do lists for any purpose\n• Bill planner\n• Shopping lists\n• Set reminders\n• Task management\n• Business calendar\n• Note taking\n• And more\n\nMicrosoft 365 Integration\n• Sync your tasks between Outlook and To Do\n• Host lists and tasks with the reliability and security of Microsoft 365\n• Compile tasks from across your Microsoft 365 apps and services\n\nWhether it\u0027s for work, school, or home, To Do helps you organize and simplify your plans. To Do is free and available on all your devices.\n\nLearn more: https://to-do.microsoft.com\nFollow us on Twitter: @MicrosoftToDo\nHave an idea or feature suggestion? https://todo.uservoice.com/\nNeed support? https://todosupport.helpshift.com/\n\nBy installing Microsoft To Do, you agree to the Microsoft Terms of Use: https://go.microsoft.com/fwlink/?linkid=842575",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.to-do",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-to-do/id1212616790?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Translator",
        "description": "Microsoft Translator is a free, personal translation app for more than 70 languages, to translate text, voice, conversations, camera photos and screenshots. You can even download languages for offline translation for free to use when you travel!\n\n•\tText translation into over 70 languages*, for online and offline use\n•\tCamera translation to translate text within photos and screenshots\n•\tVoice translation to translate speech, and a split-screen mode for two participants having a bilingual conversation\n•\tMulti-person conversation translation - connect your devices and have in-person conversations with up to 100 people across multiple languages\n•\tPhrasebooks for verified translations and pronunciation guides to help you learn important phrases in foreign languages when you travel\n•\tLook up alternate translations and meanings of a word to find the best translation to express yourself\n•\tDownload languages for offline use for when you travel without an internet connection\n•\tHear your translated phrase out loud to help you learn how to say the translation\n•\tView transliterations (pronunciation guides) to help you pronounce the translation (includes Pinyin support for Chinese)\n•\tShare your translations with other apps\n•\tPin and save your most frequent translations for later\n•\tTranslate websites on Safari using the Microsoft Translator browser extension\n•\tSpeak to your Apple watch to get an instant translation\n•\tAutomatically sync translations between your phone and Apple watch\n\nTranslator supports the following languages:  Afrikaans, Arabic, Bangla, Bosnian (Latin), Bulgarian, Cantonese (Traditional), Catalan, Chinese (Simplified), Chinese (Traditional), Croatian, Czech, Danish, Dutch, English, Estonian, Fijian, Filipino, Finnish, French, German, Greek, Haitian Creole, Hebrew, Hindi, Hmong Daw, Hungarian, Icelandic, Indonesian, Italian, Japanese, Kiswahili, Korean, Latvian, Lithuanian, Malagasy, Malay, Maltese, Norwegian, Persian, Polish, Portuguese, Quer\u0027etaro Otomi, Romanian, Russian, Serbian (Cyrillic), Serbian (Latin), Slovak, Slovenian, Spanish, Swedish, Tahitian, Tamil, Telugu, Thai, Tongan, Turkish, Ukrainian, Urdu, Vietnamese, Welsh, and Yucatec Maya.\n\nMicrosoft Translator is powered by cutting-edge technology used by Office, Bing, Skype, Internet Explorer as well as by partners such as Twitter, Yelp, eBay, WeChat and more.\n*Some features are not available in all languages.\n\n// Request for User Permissions //\n\n[Mandatory access]\n1. View Network access\nTo detect whether the device is on Wi-Fi, mobile data, or not connected to a network. This helps the app know whether it should translate while online, or use an offline language pack.\n2. Network access\nFor access to Wi-Fi or mobile data to perform text or speech translations, and download offline language packs.\n\n[Optional access]\n1. Camera\nTo take pictures for image translations, and to scan QR codes when joining a conversation.\n2. Microphone\nTo translate speech.\n3. Photos/Media/Files\nTo open photos from the device for image translation.\n4. Storage\nTo open photos from the device for image translation, and to save downloaded offline language packs.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.translator",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-translator/id1018949559?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Whiteboard",
        "description": "Microsoft Whiteboard provides a freeform intelligent canvas where teams can ideate, create, and collaborate visually via the cloud. Designed for pen and touch, it lets you write or draw as smoothly as you would with ink, while automatically recognizing and transforming shapes and tables as you draw. It enhances teamwork by allowing all team members to edit and comment directly on the canvas in real time, no matter where they are. And all your work stays safe in the cloud, ready to be picked back up from another location or device.\n \n-- Create freely, work naturally –\nMicrosoft Whiteboard provides an infinite canvas where imagination has room to grow: draw, type, add a sticky or an image, stack things up, move them around – it’s all possible. The touch-first, pen-first interface frees your ideas from the keyboard, and the intelligent inking technology transforms your doodles into great-looking tables, shapes, and lines that can be copied, pasted, and combined with other objects.\n \n--Collaborate in real time, wherever you are—\nMicrosoft Whiteboard brings every member of a team together, whether they’re huddled around a wall-size touchscreen or working from their own devices across the globe. On the Whiteboard canvas, you can see where others are in real time and start inking on the same area – or not. It’s about getting everyone on the same page – or board.\n \n--Save automatically, resume seamlessly –\nForget having to take photos of your whiteboards, or marking them with “Do Not Erase.” With Microsoft Whiteboard, your brainstorming sessions are saved automatically to the Microsoft cloud, so you can pick up where you left off, whenever – and wherever – inspiration strikes next.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.whiteboard",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-whiteboard/id1352499399?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Microsoft Word",
        "description": "The trusted Word app lets you create, edit, view, and share your files with others quickly and easily. Send, view and edit Office docs attached to emails from your phone with this powerful word processing app from Microsoft.\n\nWith Word, your office moves with you. Whether you’re a blogger, writer, journalist, columnist, student, or a project manager working on documentation, Word is as handy as you want it to be.\n\nMake impactful text documents, scripts, blogs, write-ups, or resumes. Customize your document, letter, resume, or notes your way with robust tools that enable you to accomplish your best writing with the best format options and templates.\n\nGet the complete Microsoft Office experience when you sign in with your Microsoft 365 subscription. Create and edit documents, collaborate and share with ease when you download Microsoft Word today.\n\nCreate Documents\n• Jump-start your projects, assignments, letters, blogs, scripts, notes, write-ups, or resume with beautifully designed modern templates.\n• Use rich formatting and layout options to note down your ideas and express them in writing.\n• Document formats and layouts stay pristine and look great on any device.\n\nRead, Write, \u0026 Edit Documents\n• Reading view lets you read lengthy docs, letters, scripts, and more on your device with ease.\n• Use familiar writing and editing tools as you’d find on a desktop word processor.\n\nCollaborate Anywhere\n• Share thoughts by commenting in docs right next to the text you’re discussing.\n• Everyone can collaborate and stay on top of changes to the text, layout, and formatting.\n• As you and your team make changes, you can revert to view earlier drafts with improved version history in Word.\n\nSimplified Sharing\n• Share files with a few taps to quickly invite others to edit or view your documents.\n• Easily manage permissions and see who’s working in a document.\n• Copy the content of your Word files directly into the body of an email message with its format intact or attach your docs to an email and make sharing easier.\n\nDownload Microsoft Word now and get the best way to create, share and edit documents from your iPhone or iPad.\n\nTo create or edit documents, sign in with a free Microsoft account on devices with a screen size smaller than 10.1 inches.\nUnlock the full Microsoft Office experience with a qualifying Microsoft 365 subscription for your phone, tablet, PC, and Mac.\n\nMonthly Microsoft 365 subscriptions purchased from the app will be charged to your App Store account and will automatically renew within 24 hours prior to the end of the current subscription period unless auto-renewal is disabled beforehand. You can manage your subscriptions in your App Store account settings.\n\nThis app is provided by either Microsoft or a third-party app publisher and is subject to a separate privacy statement and terms and conditions. Data provided through the use of this store and this app may be accessible to Microsoft or the third-party app publisher, as applicable, and transferred to, stored, and processed in the United States or any other country where Microsoft or the app publisher and their affiliates or service providers maintain facilities.\n\nPlease refer to the Microsoft Software License Terms for Microsoft 365. See “License Agreement” link under Information. By installing the app, you agree to these terms and conditions.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": true,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.Office.Word",
        "appStoreUrl": "https://apps.apple.com/us/app/microsoft-word/id586447913?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Power Apps",
        "description": "Get Power Apps to use business apps made for your team and organization.\n\nInstall Power Apps for iPhone and iPad to:\n• Use custom Power Apps that were shared with you\n• Get work done from anywhere and on any device\n• Automate tasks and accomplish more\n• Access, capture, and share business data",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.msapps",
        "appStoreUrl": "https://apps.apple.com/us/app/power-apps/id1047318566?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Power Automate",
        "description": "Carry the full power of Power Automate in your pocket. With Power Automate, you can create automated workflows between your favorite apps and services to streamline your business, save time, and work more efficiently. \n \nUse Power Automate to:\n \nGet a notification when you receive an email from your boss\nRecord your work hours to a spreadsheet with the tap of a button\nAutomatically download email attachments to cloud storage\nCapture, track and follow up on sales leads, and connect to your CRM platform\nGet notified when a work item is updated\nSo much more!\n \nKey features:\n \nEasily create new flows - from anywhere!\nBrowse hundreds of popular templates\nConnect to your favorite apps and services\nUse buttons to trigger flows with a tap\nShare buttons with your team\nMonitor flow activity directly from your mobile device\nGrant approvals from the palm of your hand\n \nHundreds of apps and services connect with Power Automate, including OneDrive, Dynamics 365, Slack, Office 365, Outlook, Salesforce, Facebook, Twitter, JIRA, Google Drive, Azure, Dropbox, and more!\n \nBest of all, Power Automate integrates seamlessly with SharePoint and Office 365, so you can create custom, end-to-end solutions, in a familiar environment, for your whole team to enjoy.\n \n \nDownload the Power Automate app and start automating your tasks today!",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.procsimo",
        "appStoreUrl": "https://apps.apple.com/us/app/power-automate/id1094928825?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS QR Code Reader ·",
        "description": "The best app to scan QR Code and Barcode!\n\nMore than 15 types supported : QR Code, Barcode, Datamatrix, Code128, Code39, EAN-8, EAN-13, Google Auth\n\nWith powerful features :\n- Products \u0026 food detailed informations\n- QR Code detailed data cards\n- Scan history\n- Folders to stay organized\n- Batch Scan\n- CSV Export\n\nSUBSCRIPTIONS\n\n- You can subscribe for PRO account with unlimited scans, products infos and no ads\n- Subscription options are: 1-month with 3-day trial, 3-month, 1-year \n- Subscription automatically renews for the same price and duration period as the original \"one month\", \"one quarter\", \"one year\" package unless auto-renew is turned off at least 24-hours before the end of the current period\n- Payment will be charged to iTunes Account at confirmation of purchase\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user\u0027s Account Settings after purchase\n- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable\n\nLinks to our Terms of Service and Privacy Policy can be found below\nhttps://sites.google.com/view/qrcodeios/home",
        "publisher": "TinyLab",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.pastapizza.qrcode",
        "appStoreUrl": "https://apps.apple.com/us/app/qr-code-reader/id1200318119?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Remote Desktop Mobile",
        "description": "Use Microsoft Remote Desktop for iOS to connect to a remote PC or virtual apps and desktops made available by your admin. With Microsoft Remote Desktop, you can be productive no matter where you are.\n\nGET STARTED\n\nConfigure your PC for remote access using the information at https://aka.ms/rdsetup.\n\nLearn about our other Remote Desktop clients at https://aka.ms/rdclients.\n\nKEY ​FEATURES\n\n• Access remote PCs running Windows Professional or Enterprise and Windows Server.\n• Access managed resources published by your admin\n• Connect through a Remote Desktop Gateway.\n• Rich multi-touch experience supporting Windows gestures.\n• Secure connection to your data and applications.\n• Simple management of your connections and user account from the Connection Center.\n• Audio and video streaming.\n• Redirect your clipboard, and local devices such as microphones and cameras.\n\nSubmit feedback at https://aka.ms/rdiosfbk.",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.rdc.ios",
        "appStoreUrl": "https://apps.apple.com/us/app/remote-desktop-mobile/id714464092?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS Surface Audio",
        "description": "Here are the things you can do:\n• Update your earbuds and headphones\n• View and change device info\n• View battery info and volume level\n• Personalize settings\n• Change equalizer settings to get the sound you want\n• Control which devices are connected\n• Change language settings\n• Reset your earbuds and headphones to the factory settings\n• Watch tutorial videos\n• Send us feedback",
        "publisher": "Microsoft Corporation",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.microsoft.SurfaceAudio",
        "appStoreUrl": "https://apps.apple.com/us/app/surface-audio/id1476329686?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iOS WhatsApp Messenger",
        "description": "Simple. Reliable. Secure. — WhatsApp from Facebook\n\nWhatsApp Messenger is a FREE messaging app available for iPhone and other smartphones. WhatsApp uses your phone\u0027s Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family. Switch from SMS to WhatsApp to send and receive messages, calls, photos, videos, documents, and Voice Messages.\n\nWHY USE WHATSAPP:\n\n• NO FEES: WhatsApp uses your phone\u0027s Internet connection (4G/3G/2G/EDGE or Wi-Fi, as available) to let you message and call friends and family, so you don\u0027t have to pay for every message or call.* There are no subscription fees to use WhatsApp.\n\n• MULTIMEDIA: Send and receive photos, videos, documents, and Voice Messages.\n\n• FREE CALLS: Call your friends and family for free with WhatsApp Calling, even if they\u0027re in another country.* WhatsApp calls use your phone\u0027s Internet connection rather than your cellular plan\u0027s voice minutes. (Note: Data charges may apply. Contact your provider for details. Also, you can\u0027t access 911 and other emergency service numbers through WhatsApp).\n\n• GROUP CHAT: Enjoy group chats with your contacts so you can easily stay in touch with your friends or family.\n\n• WHATSAPP WEB: You can also send and receive WhatsApp messages right from your computer\u0027s browser.\n\n• NO INTERNATIONAL CHARGES: There\u0027s no extra charge to send WhatsApp messages internationally. Chat with your friends around the world and avoid international SMS charges.*\n\n• SAY NO TO USERNAMES AND PINS: Why bother having to remember yet another username or PIN? WhatsApp works with your phone number, just like SMS, and integrates seamlessly with your phone\u0027s existing address book.\n\n• ALWAYS LOGGED IN: With WhatsApp, you\u0027re always logged in so you don\u0027t miss messages. No more confusion about whether you\u0027re logged in or logged out.\n\n• QUICKLY CONNECT WITH YOUR CONTACTS: Your address book is used to quickly and easily connect you with your contacts who have WhatsApp so there\u0027s no need to add hard-to-remember usernames.\n\n• OFFLINE MESSAGES: Even if you miss your notifications or turn off your phone, WhatsApp will save your recent messages until the next time you use the app.\n\n• AND MUCH MORE: Share your location, exchange contacts, set custom wallpapers and notification sounds, broadcast messages to multiple contacts at once, and more!\n\n*Data charges may apply. Contact your provider for details.\n\n--------------------------------------------------------- \nWe\u0027re always excited to hear from you! If you have feedback, questions, or concerns, please email us at:\niphone-support@whatsapp.com\n\nor follow us on twitter:\n\nhttp://twitter.com/WhatsApp\n@WhatsApp\n---------------------------------------------------------\n\nNote: WhatsApp is a telephony app, so iPod and iPad are not supported devices.",
        "publisher": "WhatsApp Inc.",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "net.whatsapp.WhatsApp",
        "appStoreUrl": "https://apps.apple.com/us/app/whatsapp-messenger/id310633997?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }, {
        "@odata.type": "#microsoft.graph.iosStoreApp",
        "displayName": "iSO Google Maps - Transit \u0026 Food",
        "description": "Navigate your world faster and easier with Google Maps. Over 220 countries and territories mapped and hundreds of millions of businesses and places on the map. Get real-time GPS navigation, traffic, and transit info, and find what you need by getting the latest information on businesses, including grocery stores, pharmacies and other important places.\n\nGet where you need to go efficiently:\n• Find the best route with automatic rerouting based on live traffic, incidents, and road closure\n\nFind important businesses:\n• Know what’s open in your area and their latest business hours\n• Find local restaurants offering delivery and takeout\n• Create lists of your important places \n\nGet there faster with real-time updates\n• Beat traffic with real-time ETAs and traffic conditions\n• Catch your bus, train, or ride-share with real-time transit info\n• Save time with automatic rerouting based on live traffic, incidents, and road closure\n• With Live View in Google Maps, see the way you need to go with arrows and directions placed right on top of your world. There’s no second guessing or missing another turn.\n\nMore experiences on Google Maps\n• Offline maps to search and navigate without an internet connection\n• Street View and indoor imagery for restaurants, shops, museums and more\n• Indoor maps to quickly find your way inside big places like airports, malls and stadiums\n\nSome features not available in all countries\n\nNavigation isn\u0027t intended to be used by oversized or emergency vehicles",
        "publisher": "Google LLC",
        "largeIcon": null,
        "isFeatured": false,
        "privacyInformationUrl": "",
        "informationUrl": null,
        "owner": "",
        "developer": "",
        "notes": "",
        "roleScopeTagIds": [],
        "bundleId": "com.google.Maps",
        "appStoreUrl": "https://apps.apple.com/us/app/google-maps-transit-food/id585027354?uo=4",
        "applicableDeviceType": {
            "iPad": true,
            "iPhoneAndIPod": true
        },
        "minimumSupportedOperatingSystem": {
            "v8_0": true,
            "v9_0": false,
            "v10_0": false,
            "v11_0": false,
            "v12_0": false,
            "v13_0": false
        }
    }
]
