{
    "@odata.type": "#microsoft.graph.intuneBrandingProfile",
	"displayName": "##AlyaCompanyNameFull##",
	"disableDeviceCategorySelection": false,
	"showLogo": true,
	"showNameNextToLogo": true,
	"landingPageCustomizedImage": null,
	"showDisplayNameNextToLogo": true,
	"contactITName": "##AlyaSupportTitle##",
	"contactITPhoneNumber": "##AlyaSupportTel##",
	"contactITEmailAddress": "##AlyaSupportMail##",
	"contactITNotes": null,
	"companyPortalBlockedActions": [],
	"customCanSeePrivacyMessage": null,
	"customCantSeePrivacyMessage": null,
	"onlineSupportSiteUrl": "##AlyaSupportUrl##",
	"onlineSupportSiteName": "Support",
	"privacyUrl": "##AlyaPrivacyUrl##",
	"customPrivacyMessage": null,
	"isRemoveDeviceDisabled": false,
	"isFactoryResetDisabled": false,
	"showAzureADEnterpriseApps": false,
	"showConfigurationManagerApps": false,
	"showOfficeWebApps": false,
	"sendDeviceOwnershipChangePushNotification": false,
	"enrollmentAvailability": "availableWithPrompts",
	"lightBackgroundLogo": null,
	"darkBackgroundLogo": null,
	"themeColorLogo": null,
	"themeColor": {
		"@odata.type": "#microsoft.graph.rgbColor",
		"r": 255,
		"g": 255,
		"b": 255
	}
}
