{
    "@odata.type": "#microsoft.graph.intuneBrandingProfile",
    "companyPortalBlockedActions": [
    ],
    "contactITEmailAddress": "##AlyaSupportMail##",
    "contactITName": "##AlyaSupportTitle##",
    "contactITNotes": null,
    "contactITPhoneNumber": "##AlyaSupportTel##",
    "customCanSeePrivacyMessage": "",
    "customCantSeePrivacyMessage": "",
    "customPrivacyMessage": "",
    "darkBackgroundLogo": null,
    "disableDeviceCategorySelection": false,
    "displayName": "##AlyaCompanyNameFull##",
    "enrollmentAvailability": "availableWithPrompts",
    "isFactoryResetDisabled": false,
    "isRemoveDeviceDisabled": false,
    "landingPageCustomizedImage": null,
    "lightBackgroundLogo": null,
    "onlineSupportSiteName": "Support",
    "onlineSupportSiteUrl": "##AlyaSupportUrl##",
    "privacyUrl": "##AlyaPrivacyUrl##",
    "roleScopeTagIds": [
    ],
    "sendDeviceOwnershipChangePushNotification": false,
    "showAzureADEnterpriseApps": false,
    "showConfigurationManagerApps": false,
    "showDisplayNameNextToLogo": true,
    "showLogo": true,
    "showNameNextToLogo": true,
    "showOfficeWebApps": false,
    "themeColor": {
        "@odata.type": "#microsoft.graph.rgbColor",
        "b": 255,
        "g": 255,
        "r": 255
    }
}