[{
        "name": "WIN LAPS Configuration",
        "roleScopeTagIds": ["0"],
        "technologies": "mdm",
        "creationSource": null,
        "description": "Configures LAPS on local devices",
        "priorityMetaData": null,
        "platforms": "windows10",
        "templateReference": {
            "templateId": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
            "templateDisplayName": "Local admin password solution (Windows LAPS)",
            "templateFamily": "endpointSecurityAccountProtection",
            "templateDisplayVersion": "Version 1"
        },
        "settings": [{
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
				"settingInstance": {
                    "choiceSettingValue": {
                        "value": "device_vendor_msft_laps_policies_backupdirectory_1",
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92",
                            "useTemplateDefault": false
                        },
                        "children": [{
                                "simpleSettingValue": {
                                    "value": 7,
                                    "settingValueTemplateReference": null,
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                                },
                                "settingInstanceTemplateReference": null,
                                "settingDefinitionId": "device_vendor_msft_laps_policies_passwordagedays_aad",
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
                            }
                        ]
                    },
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "a3270f64-e493-499d-8900-90290f61ed8a"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_backupdirectory",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                },
                "id": "0"
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "settingInstance": {
                    "simpleSettingValue": {
                        "value": "lapsadmin",
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "992c7fce-f9e4-46ab-ac11-e167398859ea",
                            "useTemplateDefault": false
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                    },
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "d3d7d492-0019-4f56-96f8-1967f7deabeb"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_administratoraccountname",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
                },
                "id": "1"
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "settingInstance": {
                    "choiceSettingValue": {
                        "value": "device_vendor_msft_laps_policies_passwordcomplexity_4",
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "aa883ab5-625e-4e3b-b830-a37a4bb8ce01",
                            "useTemplateDefault": false
                        },
                        "children": []
                    },
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "8a7459e8-1d1c-458a-8906-7b27d216de52"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_passwordcomplexity",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                },
                "id": "2"
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "settingInstance": {
                    "simpleSettingValue": {
                        "value": 24,
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "d08f1266-5345-4f53-8ae1-4c20e6cb5ec9",
                            "useTemplateDefault": false
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                    },
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "da7a1dbd-caf7-4341-ab63-ece6f994ff02"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_passwordlength",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
                },
                "id": "3"
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "settingInstance": {
                    "choiceSettingValue": {
                        "value": "device_vendor_msft_laps_policies_postauthenticationactions_5",
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "68ff4f78-baa8-4b32-bf3d-5ad5566d8142",
                            "useTemplateDefault": false
                        },
                        "children": []
                    },
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "d9282eb1-d187-42ae-b366-7081f32dcfff"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationactions",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                },
                "id": "4"
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "settingInstance": {
                    "simpleSettingValue": {
                        "value": 12,
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "0deb6aee-8dac-40c4-a9dd-c3718e5c1d52",
                            "useTemplateDefault": false
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                    },
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "a9e21166-4055-4042-9372-efaf3ef41868"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationresetdelay",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
                },
                "id": "5"
            }
        ]
    }
]