[
    {
        "Comment1": "=================================================",
        "Comment2": "WIN Update Profiles",
        "Comment3": "================================================="
    },
    {
        "@odata.type": "#microsoft.graph.windowsFeatureUpdateProfile",
        "deployableContentDisplayName": null,
        "description": "Configures features on windows11 devices",
        "displayName": "WIN11 Feature Configuration",
        "endOfSupportDate": "2025-10-14T00:00:00Z",
        "featureUpdateVersion": "Windows 11, version 25H2",
        "roleScopeTagIds": [
            "0"
        ],
        "rolloutSettings": {
            "offerEndDateTimeInUTC": null,
            "offerIntervalInDays": null,
            "offerStartDateTimeInUTC": null
        }
    },
    {
        "Comment1": "=================================================",
        "Comment2": "MAC Profiles",
        "Comment3": "================================================="
    },
    {
        "Comment1": "=================================================",
        "Comment2": "ANDROID Profiles",
        "Comment3": "================================================="
    },
    {
        "Comment1": "=================================================",
        "Comment2": "IOS Profiles",
        "Comment3": "================================================="
    }
]