[
    {
        "Comment1": "=================================================",
        "Comment2": "WIN Profiles",
        "Comment3": "================================================="
    },
    {
        "@odata.type": "#microsoft.graph.windowsDriverUpdateProfile",
        "approvalType": "automatic",
        "deploymentDeferralInDays": 7,
        "description": "Configures driver updates on windows devices",
        "displayName": "WIN DriverUpdate Configuration",
        "inventorySyncStatus": null,
        "roleScopeTagIds": [
            "0"
        ]
    },
    {
        "Comment1": "=================================================",
        "Comment2": "MAC Profiles",
        "Comment3": "================================================="
    },
    {
        "Comment1": "=================================================",
        "Comment2": "ANDROID Profiles",
        "Comment3": "================================================="
    },
    {
        "Comment1": "=================================================",
        "Comment2": "IOS Profiles",
        "Comment3": "================================================="
    }
]