[{
        "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
        "displayName": "WIN Compliance Policy",
        "description": "Checks the compliance of windows devices",
        "activeFirewallRequired": true,
        "antiSpywareRequired": true,
        "antivirusRequired": true,
        "bitLockerEnabled": true,
        "codeIntegrityEnabled": false,
        "configurationManagerComplianceRequired": false,
        "defenderEnabled": true,
        "defenderVersion": null,
        "deviceCompliancePolicyScript": null,
        "deviceThreatProtectionEnabled": false,
        "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
        "earlyLaunchAntiMalwareDriverEnabled": false,
        "localActions": [],
        "mobileOsMaximumVersion": null,
        "mobileOsMinimumVersion": null,
        "osMaximumVersion": null,
        "osMinimumVersion": null,
        "passwordBlockSimple": true,
        "passwordExpirationDays": 365,
        "passwordMinimumCharacterSetCount": null,
        "passwordMinimumLength": 8,
        "passwordMinutesOfInactivityBeforeLock": null,
        "passwordPreviousPasswordBlockCount": 1,
        "passwordRequired": true,
        "passwordRequiredToUnlockFromIdle": false,
        "passwordRequiredType": "deviceDefault",
        "requireHealthyDeviceReport": false,
        "roleScopeTagIds": ["0"],
        "rtpEnabled": true,
        "scheduledActionsForRule": [{
                "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
                "ruleName": "DefaultPolicy",
                "scheduledActionConfigurations": [{
                        "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                        "actionType": "block",
                        "gracePeriodHours": 8760,
                        "notificationMessageCCList": [],
                        "notificationTemplateId": ""
                    }
                ]
            }
        ],
        "secureBootEnabled": true,
        "signatureOutOfDate": true,
        "storageRequireEncryption": true,
        "tpmRequired": true,
        "validOperatingSystemBuildRanges": []
    }, {
        "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
        "displayName": "WIN365 Compliance Policy",
        "description": "Checks the compliance of windows365 devices",
        "activeFirewallRequired": true,
        "antiSpywareRequired": true,
        "antivirusRequired": true,
        "bitLockerEnabled": false,
        "codeIntegrityEnabled": false,
        "configurationManagerComplianceRequired": false,
        "defenderEnabled": true,
        "defenderVersion": null,
        "deviceCompliancePolicyScript": null,
        "deviceThreatProtectionEnabled": false,
        "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
        "earlyLaunchAntiMalwareDriverEnabled": false,
        "localActions": [],
        "mobileOsMaximumVersion": null,
        "mobileOsMinimumVersion": null,
        "osMaximumVersion": null,
        "osMinimumVersion": null,
        "passwordBlockSimple": true,
        "passwordExpirationDays": 365,
        "passwordMinimumCharacterSetCount": null,
        "passwordMinimumLength": 8,
        "passwordMinutesOfInactivityBeforeLock": null,
        "passwordPreviousPasswordBlockCount": 1,
        "passwordRequired": true,
        "passwordRequiredToUnlockFromIdle": false,
        "passwordRequiredType": "deviceDefault",
        "requireHealthyDeviceReport": false,
        "roleScopeTagIds": ["0"],
        "rtpEnabled": true,
        "scheduledActionsForRule": [{
                "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
                "ruleName": "DefaultPolicy",
                "scheduledActionConfigurations": [{
                        "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                        "actionType": "block",
                        "gracePeriodHours": 8760,
                        "notificationMessageCCList": [],
                        "notificationTemplateId": ""
                    }
                ]
            }
        ],
        "secureBootEnabled": true,
        "signatureOutOfDate": true,
        "storageRequireEncryption": true,
        "tpmRequired": true,
        "validOperatingSystemBuildRanges": []
    }, {
        "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
        "displayName": "AND Enterprise Personal Compliance Policy",
        "description": "Checks the compliance of personal owned android devices",
        "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
        "deviceThreatProtectionEnabled": false,
        "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
        "localActions": [],
        "minAndroidSecurityPatchLevel": null,
        "osMaximumVersion": null,
        "osMinimumVersion": null,
        "passwordExpirationDays": 365,
        "passwordMinimumLength": 8,
        "passwordMinutesOfInactivityBeforeLock": null,
        "passwordPreviousPasswordBlockCount": 1,
        "passwordRequired": true,
        "passwordRequiredType": "numeric",
        "passwordSignInFailureCountBeforeFactoryReset": null,
        "roleScopeTagIds": ["0"],
        "scheduledActionsForRule": [{
                "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
                "ruleName": "DefaultPolicy",
                "scheduledActionConfigurations": [{
                        "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                        "actionType": "block",
                        "gracePeriodHours": 8760,
                        "notificationMessageCCList": [],
                        "notificationTemplateId": ""
                    }
                ]
            }
        ],
        "securityBlockJailbrokenDevices": false,
        "securityDisableUsbDebugging": true,
        "securityPreventInstallAppsFromUnknownSources": true,
        "securityRequireCompanyPortalAppIntegrity": true,
        "securityRequireGooglePlayServices": false,
        "securityRequireSafetyNetAttestationBasicIntegrity": false,
        "securityRequireSafetyNetAttestationCertifiedDevice": false,
        "securityRequireUpToDateSecurityProviders": false,
        "securityRequireVerifyApps": false,
        "storageRequireEncryption": true
    }, {
        "@odata.type": "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
        "displayName": "AND Enterprise Owned Compliance Policy",
        "description": "Checks the compliance of company owned android devices",
        "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
        "deviceThreatProtectionEnabled": false,
        "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
        "localActions": [],
        "minAndroidSecurityPatchLevel": null,
        "osMaximumVersion": null,
        "osMinimumVersion": null,
        "passwordExpirationDays": 365,
        "passwordMinimumLength": 8,
        "passwordMinimumLetterCharacters": null,
        "passwordMinimumLowerCaseCharacters": null,
        "passwordMinimumNonLetterCharacters": null,
        "passwordMinimumNumericCharacters": null,
        "passwordMinimumSymbolCharacters": null,
        "passwordMinimumUpperCaseCharacters": null,
        "passwordMinutesOfInactivityBeforeLock": 10,
        "passwordPreviousPasswordCountToBlock": 1,
        "passwordRequired": true,
        "passwordRequiredType": "numeric",
        "roleScopeTagIds": ["0"],
        "scheduledActionsForRule": [{
                "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
                "ruleName": "DefaultPolicy",
                "scheduledActionConfigurations": [{
                        "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                        "actionType": "block",
                        "gracePeriodHours": 8760,
                        "notificationMessageCCList": [],
                        "notificationTemplateId": ""
                    }
                ]
            }
        ],
        "securityRequireSafetyNetAttestationBasicIntegrity": false,
        "securityRequireSafetyNetAttestationCertifiedDevice": false,
        "storageRequireEncryption": null
    }, {
        "@odata.type": "#microsoft.graph.iosCompliancePolicy",
        "displayName": "IOS Compliance Policy",
        "description": "Checks the compliance of iOS devices",
        "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
        "deviceThreatProtectionEnabled": false,
        "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
        "localActions": [],
        "managedEmailProfileRequired": true,
        "osMaximumBuildVersion": null,
        "osMaximumVersion": null,
        "osMinimumBuildVersion": null,
        "osMinimumVersion": null,
        "passcodeBlockSimple": true,
        "passcodeExpirationDays": 365,
        "passcodeMinimumCharacterSetCount": null,
        "passcodeMinimumLength": 8,
        "passcodeMinutesOfInactivityBeforeLock": null,
        "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
        "passcodePreviousPasscodeBlockCount": 1,
        "passcodeRequired": true,
        "passcodeRequiredType": "deviceDefault",
        "restrictedApps": [],
        "roleScopeTagIds": ["0"],
        "scheduledActionsForRule": [{
                "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
                "ruleName": "DefaultPolicy",
                "scheduledActionConfigurations": [{
                        "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                        "actionType": "block",
                        "gracePeriodHours": 8760,
                        "notificationMessageCCList": [],
                        "notificationTemplateId": ""
                    }
                ]
            }
        ],
        "securityBlockJailbrokenDevices": true
    }, {
        "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
        "displayName": "MAC Compliance Policy",
        "description": "Checks the compliance from MAC devices",
        "deviceThreatProtectionEnabled": false,
        "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
        "firewallBlockAllIncoming": true,
        "firewallEnableStealthMode": false,
        "firewallEnabled": true,
        "gatekeeperAllowedAppSource": "notConfigured",
        "localActions": [],
        "osMaximumBuildVersion": null,
        "osMaximumVersion": null,
        "osMinimumBuildVersion": null,
        "osMinimumVersion": null,
        "passwordBlockSimple": true,
        "passwordExpirationDays": 365,
        "passwordMinimumCharacterSetCount": null,
        "passwordMinimumLength": 8,
        "passwordMinutesOfInactivityBeforeLock": null,
        "passwordPreviousPasswordBlockCount": 1,
        "passwordRequired": true,
        "passwordRequiredType": "deviceDefault",
        "roleScopeTagIds": ["0"],
        "scheduledActionsForRule": [{
                "@odata.type": "#microsoft.graph.deviceComplianceScheduledActionForRule",
                "ruleName": "DefaultPolicy",
                "scheduledActionConfigurations": [{
                        "@odata.type": "#microsoft.graph.deviceComplianceActionItem",
                        "actionType": "block",
                        "gracePeriodHours": 8760,
                        "notificationMessageCCList": [],
                        "notificationTemplateId": ""
                    }
                ]
            }
        ],
        "storageRequireEncryption": true,
        "systemIntegrityProtectionEnabled": true
    }
]
