[{
        "Comment1": "=================================================",
        "Comment2": "WIN Update Profiles",
        "Comment3": "================================================="
    }, {
        "@odata.type": "#microsoft.graph.windowsFeatureUpdateProfile",
		"displayName": "WIN10 Feature Configuration",
        "description": "Configures features on windows10 devices",
        "featureUpdateVersion": "Windows 10, version 22H2",
        "roleScopeTagIds": ["0"],
        "deployableContentDisplayName": null,
        "rolloutSettings": {
            "offerIntervalInDays": null,
            "offerEndDateTimeInUTC": null,
            "offerStartDateTimeInUTC": null
        },
        "endOfSupportDate": "2024-10-08T00:00:00Z"
    }, {
        "@odata.type": "#microsoft.graph.windowsFeatureUpdateProfile",
		"displayName": "WIN11 Feature Configuration",
        "description": "Configures features on windows11 devices",
        "featureUpdateVersion": "Windows 11, version 22H2",
        "roleScopeTagIds": ["0"],
        "deployableContentDisplayName": null,
        "rolloutSettings": {
            "offerIntervalInDays": null,
            "offerEndDateTimeInUTC": null,
            "offerStartDateTimeInUTC": null
        },
        "endOfSupportDate": "2025-10-14T00:00:00Z"
    }, {
        "Comment1": "=================================================",
        "Comment2": "MAC Profiles",
        "Comment3": "================================================="
    }, {
        "Comment1": "=================================================",
        "Comment2": "ANDROID Profiles",
        "Comment3": "================================================="
    }, {
        "Comment1": "=================================================",
        "Comment2": "IOS Profiles",
        "Comment3": "================================================="
    }
]
