[{
        "Comment1": "=================================================",
        "Comment2": "General Policies",
        "Comment3": "================================================="
    }, {
        "Comment1": "=================================================",
        "Comment2": "WIN Policies",
        "Comment3": "================================================="
    }, {
        "name": "WIN Outlook Disable New Outlook Migration",
        "description": "Disables the migration to new outlook",
        "roleScopeTagIds": [
            "0"
        ],
        "priorityMetaData": null,
        "creationSource": null,
        "settings": [{
                "id": "0",
                "settingInstance": {
                    "settingDefinitionId": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_donewoutlookautomigration",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "value": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_donewoutlookautomigration_0",
                        "children": []
                    },
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "1",
                "settingInstance": {
                    "settingDefinitionId": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "value": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals_1",
                        "children": [{
                                "settingDefinitionId": "user_vendor_msft_policy_config_outlk16v14~policy~l_microsoftofficeoutlook~l_outlookoptions~l_other_l_newoutlookautomigrationretryintervals_l_newoutlookautomigrationretryintervalsid",
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "simpleSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "value": 0
                                },
                                "settingInstanceTemplateReference": null
                            }
                        ]
                    },
                    "settingInstanceTemplateReference": null
                }
            }
        ],
        "settingCount": 2,
        "technologies": "mdm",
        "platforms": "windows10",
        "templateReference": {
            "templateDisplayName": null,
            "templateId": "",
            "templateDisplayVersion": null,
            "templateFamily": "none"
        }
    }, {
        "name": "WIN Copilot Hardware Key",
        "description": "Sets the SetCopilotHardwareKey to the W365 app",
        "roleScopeTagIds": [
            "0"
        ],
        "priorityMetaData": null,
        "platforms": "windows10",
        "settings": [{
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "id": "0",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "simpleSettingValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": "Microsoft.MicrosoftOfficeHub_8wekyb3d8bbwe!Microsoft.MicrosoftOfficeHub"
                    },
                    "settingInstanceTemplateReference": null,
                    "settingDefinitionId": "user_vendor_msft_policy_config_windowsai_setcopilothardwarekey"
                }
            }
        ],
        "technologies": "mdm",
        "templateReference": {
            "templateFamily": "none",
            "templateDisplayVersion": null,
            "templateDisplayName": null,
            "templateId": ""
        },
        "creationSource": null,
        "settingCount": 1
    }, {
        "name": "WIN LAPS Configuration",
        "creationSource": null,
        "description": "Configures LAPS on local devices",
        "platforms": "windows10",
        "priorityMetaData": null,
        "roleScopeTagIds": [
            "0"
        ],
        "settings": [{
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "id": "0",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [{
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "device_vendor_msft_laps_policies_passwordagedays_aad",
                                "settingInstanceTemplateReference": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": 7
                                }
                            }
                        ],
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92",
                            "useTemplateDefault": false
                        },
                        "value": "device_vendor_msft_laps_policies_backupdirectory_1"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_backupdirectory",
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "a3270f64-e493-499d-8900-90290f61ed8a"
                    }
                }
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "id": "1",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_laps_policies_administratoraccountname",
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "d3d7d492-0019-4f56-96f8-1967f7deabeb"
                    },
                    "simpleSettingValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "992c7fce-f9e4-46ab-ac11-e167398859ea",
                            "useTemplateDefault": false
                        },
                        "value": "lapsadmin"
                    }
                }
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "id": "2",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "aa883ab5-625e-4e3b-b830-a37a4bb8ce01",
                            "useTemplateDefault": false
                        },
                        "value": "device_vendor_msft_laps_policies_passwordcomplexity_4"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_passwordcomplexity",
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "8a7459e8-1d1c-458a-8906-7b27d216de52"
                    }
                }
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "id": "3",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_laps_policies_passwordlength",
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "da7a1dbd-caf7-4341-ab63-ece6f994ff02"
                    },
                    "simpleSettingValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "d08f1266-5345-4f53-8ae1-4c20e6cb5ec9",
                            "useTemplateDefault": false
                        },
                        "value": 24
                    }
                }
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "id": "4",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "68ff4f78-baa8-4b32-bf3d-5ad5566d8142",
                            "useTemplateDefault": false
                        },
                        "value": "device_vendor_msft_laps_policies_postauthenticationactions_5"
                    },
                    "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationactions",
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "d9282eb1-d187-42ae-b366-7081f32dcfff"
                    }
                }
            }, {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
                "id": "5",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationresetdelay",
                    "settingInstanceTemplateReference": {
                        "settingInstanceTemplateId": "a9e21166-4055-4042-9372-efaf3ef41868"
                    },
                    "simpleSettingValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": {
                            "settingValueTemplateId": "0deb6aee-8dac-40c4-a9dd-c3718e5c1d52",
                            "useTemplateDefault": false
                        },
                        "value": 12
                    }
                }
            }
        ],
        "technologies": "mdm",
        "templateReference": {
            "templateDisplayName": "Local admin password solution (Windows LAPS)",
            "templateDisplayVersion": "Version 1",
            "templateFamily": "endpointSecurityAccountProtection",
            "templateId": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1"
        }
    }, {
        "Comment1": "=================================================",
        "Comment2": "MAC Policies",
        "Comment3": "================================================="
    }, {
        "description": "Configure the Antivirus engine settings to manage the preferences of the antivirus component of Microsoft Defender for Endpoint.",
        "name": "MAC Defender Configuration",
        "platforms": "macOS",
        "roleScopeTagIds": [
            "0"
        ],
        "settingCount": 25,
        "settings": [{
                "id": "0",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_maximumondemandscanthreads",
                    "settingInstanceTemplateReference": null,
                    "simpleSettingValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 2
                    }
                }
            }, {
                "id": "1",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_enablefilehashcomputation_false"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_enablefilehashcomputation",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "2",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_passivemode_false"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_passivemode",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "3",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_enablerealtimeprotection_true"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_enablerealtimeprotection",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "4",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "5",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_exclusionsmergepolicy_0"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_exclusionsmergepolicy",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "6",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_scanafterdefinitionupdate_true"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_scanafterdefinitionupdate",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "7",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "groupSettingCollectionValue": [{
                            "children": [{
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "choiceSettingValue": {
                                        "children": [{
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                "settingDefinitionId": "com.apple.managedclient.preferences_exclusions_item_name",
                                                "settingInstanceTemplateReference": null,
                                                "simpleSettingValue": {
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                    "settingValueTemplateReference": null,
                                                    "value": "Backups.backupdb"
                                                }
                                            }
                                        ],
                                        "settingValueTemplateReference": null,
                                        "value": "com.apple.managedclient.preferences_exclusions_item_$type_2"
                                    },
                                    "settingDefinitionId": "com.apple.managedclient.preferences_exclusions_item_$type",
                                    "settingInstanceTemplateReference": null
                                }
                            ],
                            "settingValueTemplateReference": null
                        }, {
                            "children": [{
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "choiceSettingValue": {
                                        "children": [{
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "choiceSettingValue": {
                                                    "children": [
                                                    ],
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.managedclient.preferences_exclusions_item_isdirectory_true"
                                                },
                                                "settingDefinitionId": "com.apple.managedclient.preferences_exclusions_item_isdirectory",
                                                "settingInstanceTemplateReference": null
                                            }, {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                "settingDefinitionId": "com.apple.managedclient.preferences_exclusions_item_path",
                                                "settingInstanceTemplateReference": null,
                                                "simpleSettingValue": {
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                    "settingValueTemplateReference": null,
                                                    "value": "/var/log"
                                                }
                                            }
                                        ],
                                        "settingValueTemplateReference": null,
                                        "value": "com.apple.managedclient.preferences_exclusions_item_$type_0"
                                    },
                                    "settingDefinitionId": "com.apple.managedclient.preferences_exclusions_item_$type",
                                    "settingInstanceTemplateReference": null
                                }
                            ],
                            "settingValueTemplateReference": null
                        }
                    ],
                    "settingDefinitionId": "com.apple.managedclient.preferences_exclusions",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "8",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_scanhistorymaximumitems",
                    "settingInstanceTemplateReference": null,
                    "simpleSettingValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 10000
                    }
                }
            }, {
                "id": "9",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                    "settingDefinitionId": "com.apple.managedclient.preferences_scanresultsretentiondays",
                    "settingInstanceTemplateReference": null,
                    "simpleSettingValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                        "settingValueTemplateReference": null,
                        "value": 90
                    }
                }
            }, {
                "id": "10",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_scanarchives_true"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_scanarchives",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "11",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "groupSettingCollectionValue": [{
                            "children": [{
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "choiceSettingValue": {
                                        "children": [
                                        ],
                                        "settingValueTemplateReference": null,
                                        "value": "com.apple.managedclient.preferences_threattypesettings_item_value_0"
                                    },
                                    "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings_item_value",
                                    "settingInstanceTemplateReference": null
                                }, {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "choiceSettingValue": {
                                        "children": [
                                        ],
                                        "settingValueTemplateReference": null,
                                        "value": "com.apple.managedclient.preferences_threattypesettings_item_key_0"
                                    },
                                    "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings_item_key",
                                    "settingInstanceTemplateReference": null
                                }
                            ],
                            "settingValueTemplateReference": null
                        }
                    ],
                    "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettings",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "12",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_threattypesettingsmergepolicy_0"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_threattypesettingsmergepolicy",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "13",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_true"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "14",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_cloudblocklevel_1"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_cloudblocklevel",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "15",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_diagnosticlevel_0"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_diagnosticlevel",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "16",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_automaticsamplesubmission_true"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_automaticsamplesubmission",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "17",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_enabled_true"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_enabled",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "18",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                    "groupSettingCollectionValue": [{
                            "children": [{
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "choiceSettingValue": {
                                        "children": [
                                        ],
                                        "settingValueTemplateReference": null,
                                        "value": "com.apple.managedclient.preferences_tags_item_key_0"
                                    },
                                    "settingDefinitionId": "com.apple.managedclient.preferences_tags_item_key",
                                    "settingInstanceTemplateReference": null
                                }, {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                    "settingDefinitionId": "com.apple.managedclient.preferences_tags_item_value",
                                    "settingInstanceTemplateReference": null,
                                    "simpleSettingValue": {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "MAC"
                                    }
                                }
                            ],
                            "settingValueTemplateReference": null
                        }
                    ],
                    "settingDefinitionId": "com.apple.managedclient.preferences_tags",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "19",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_earlypreview_false"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_earlypreview",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "20",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_enforcementlevel_1"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "21",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection_2"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "22",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_consumerexperience_0"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_consumerexperience",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "23",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_hidestatusmenuicon_false"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_hidestatusmenuicon",
                    "settingInstanceTemplateReference": null
                }
            }, {
                "id": "24",
                "settingInstance": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "choiceSettingValue": {
                        "children": [
                        ],
                        "settingValueTemplateReference": null,
                        "value": "com.apple.managedclient.preferences_userinitiatedfeedback_0"
                    },
                    "settingDefinitionId": "com.apple.managedclient.preferences_userinitiatedfeedback",
                    "settingInstanceTemplateReference": null
                }
            }
        ],
        "technologies": "mdm,appleRemoteManagement",
        "templateReference": {
            "templateDisplayName": null,
            "templateDisplayVersion": null,
            "templateFamily": "none",
            "templateId": ""
        }
    }
]