[{
        "@odata.type": "#microsoft.graph.groupPolicyConfiguration",
        "displayName": "Win10 System Admin Templates",
        "description": "Configures System policies for win10 devices",
        "roleScopeTagIds": ["0"],
        "definitionValues": {
            "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
            "enabled": true,
            "configurationType": "policy",
            "definition": {
                "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                "classType": "machine",
                "displayName": "Turn on PowerShell Script Block Logging",
                "explainText": "\r\n        This policy setting enables logging of all PowerShell script input to the Microsoft-Windows-PowerShell/Operational event log. If you enable this policy setting,\r\n        Windows PowerShell will log the processing of commands, script blocks, functions, and scripts - whether invoked interactively, or through automation.\r\n        \r\n        If you disable this policy setting, logging of PowerShell script input is disabled.\r\n        \r\n        If you enable the Script Block Invocation Logging, PowerShell additionally logs events when invocation of a command, script block, function, or script\r\n        starts or stops. Enabling Invocation Logging generates a high volume of event logs.\r\n        \r\n        Note: This policy setting exists under both Computer Configuration and User Configuration in the Group Policy Editor. The Computer Configuration policy setting takes precedence over the User Configuration policy setting.\r\n      ",
                "categoryPath": "\\Windows Components\\Windows PowerShell",
                "supportedOn": "At least Microsoft Windows 7 or Windows Server 2008 family",
                "policyType": "admxBacked",
                "hasRelatedDefinitions": false,
                "groupPolicyCategoryId": "0bd10219-271d-4e8c-a43e-096f3a5db911",
                "minDeviceCspVersion": "7.0",
                "minUserCspVersion": null,
                "version": "1.0"
            },
            "presentationValues": {
                "@odata.type": "#microsoft.graph.groupPolicyPresentationValueBoolean",
                "value": true,
                "presentation": {
                    "@odata.type": "#microsoft.graph.groupPolicyPresentationCheckBox",
                    "label": "Log script block invocation start / stop events:",
                    "defaultChecked": false
                },
                "definition": "",
                "definitionNext": "",
                "definitionPrev": "",
                "categories": null,
                "files": null,
                "presentations": null
            }
        }
    }, {
        "@odata.type": "#microsoft.graph.groupPolicyConfiguration",
        "displayName": "Win10 OneDrive Admin Templates",
        "description": "Configures OneDrive policies for win10 devices",
        "roleScopeTagIds": ["0"],
        "definitionValues": [{
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Silently sign in users to the OneDrive sync app with their Windows credentials",
                    "explainText": "This setting lets you silently sign in users to the OneDrive sync app (OneDrive.exe) with their Windows credentials.\r\n\r\nIf you enable this setting, users who are signed in on the PC with the primary Windows account (the account used to join the PC to the domain) can set up the sync app without entering the credentials for the account. Users will still be shown OneDrive Setup so they can select folders to sync and change the location of their OneDrive folder. If a user is using the previous OneDrive for Business sync app (Groove.exe), the new sync app will attempt to take over syncing the user\u0027s OneDrive from the previous app and preserve the user\u0027s sync settings. This setting is frequently used together with \"Set the maximum size of a user\u0027s OneDrive that can download automatically\" on PCs that don\u0027t have Files On-Demand, and \"Set the default location for the OneDrive folder.\"\r\n\r\nIf you disable or do not configure this setting, users will need to sign in with their work or school account to set up sync.\r\n\r\n",
                    "categoryPath": "\\OneDrive",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "0de8c88e-9535-4d96-b6f7-52f56beaa2c5",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Silently move Windows known folders to OneDrive",
                    "explainText": "This setting lets you redirect known folders to OneDrive without any user interaction. In sync client builds below 18.171.0823.0001, this setting only redirects empty known folders to OneDrive (or known folders already redirected to a different OneDrive account). In later builds, it redirects known folders that contain content and moves the content to OneDrive. We recommend using this setting together with \"Prompt users to move Windows known folders to OneDrive.\" If moving the known folders silently does not succeed, users will be prompted to correct the error and continue.\r\n\r\nIf you enable this setting and provide your tenant ID, you can choose whether to display a notification to users after their folders have been redirected.\r\n\r\nIf you disable or do not configure this setting, your users\u0027 known folders will not be silently redirected and/or moved to OneDrive.\r\n\r\n    ",
                    "categoryPath": "\\OneDrive",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": true,
                    "groupPolicyCategoryId": "0de8c88e-9535-4d96-b6f7-52f56beaa2c5",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "f2fa7496-3af7-42c7-a036-5169143b03b0",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Tenant ID:",
                            "defaultValue": "",
                            "required": true,
                            "maxLength": 2000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }, {
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "0",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Show notification to users after folders have been redirected:",
                            "required": false,
                            "defaultItem": {
                                "displayName": "No",
                                "value": "0"
                            },
                            "items": [{
                                    "displayName": "No",
                                    "value": "0"
                                }, {
                                    "displayName": "Yes",
                                    "value": "1"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Warn users who are low on disk space",
                    "explainText": "This setting lets you specify a minimum amount of available disk space and warn users when the OneDrive sync app (OneDrive.exe) downloads a file that causes them to have less than this amount.\r\n\r\nUsers will be prompted with options to help free up space.",
                    "categoryPath": "\\OneDrive",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "22fd2a9c-471e-4bbd-82e7-f778eb867c61",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueDecimal",
                        "value": 10240,
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDecimalTextBox",
                            "label": "Minimum available disk space:",
                            "defaultValue": 500,
                            "spin": true,
                            "spinStep": 1,
                            "required": false,
                            "minValue": 0,
                            "maxValue": 10240000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Block file downloads when users are low on disk space",
                    "explainText": "This setting lets you specify a minimum amount of available disk space and block the OneDrive sync app (OneDrive.exe) from downloading files when users have less than this amount.\r\n\r\nUsers will be prompted with options to help free up space.",
                    "categoryPath": "\\OneDrive",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "22fd2a9c-471e-4bbd-82e7-f778eb867c61",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueDecimal",
                        "value": 5120,
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDecimalTextBox",
                            "label": "Minimum available disk space:",
                            "defaultValue": 200,
                            "spin": true,
                            "spinStep": 1,
                            "required": false,
                            "minValue": 0,
                            "maxValue": 10240000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Set the sync app update ring",
                    "explainText": "Updates to the OneDrive sync app (OneDrive.exe) are released to the public through three rings-first to Insiders, then Production, and finally Deferred. This setting lets you specify the sync app version for users in your organization. When you enable this setting and select a ring, users won\u0027t be able to change it.\r\n\r\nInsiders ring users will receive builds that let them preview new features coming to OneDrive.\r\n\r\nProduction ring users will get the latest features as they become available.\r\n\r\nDeferred ring users get new features, bug fixes, and performance improvements last. This ring lets you deploy updates from an internal network location and control the timing of the deployment (within a 60-day window).\r\n\r\nIf you disable or do not configure this setting, users will get OneDrive sync app updates when they become available in the Production ring. Users can join the Office or Windows Insiders programs to get updates on the Insiders ring.",
                    "categoryPath": "\\OneDrive",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "0de8c88e-9535-4d96-b6f7-52f56beaa2c5",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "5",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Update ring:",
                            "required": false,
                            "defaultItem": {
                                "displayName": "Deferred",
                                "value": "0"
                            },
                            "items": [{
                                    "displayName": "Deferred",
                                    "value": "0"
                                }, {
                                    "displayName": "Production",
                                    "value": "5"
                                }, {
                                    "displayName": "Insiders",
                                    "value": "4"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Allow OneDrive to disable Windows permission inheritance in folders synced read-only",
                    "explainText": "This setting lets the OneDrive sync app remove all inherited permissions within read-only folders syncing on a user\u0027s PC.\r\n\r\nIf you enable this setting, the OneDrive sync app can disable permission inheritance in read-only folders to improve sync speed.\r\n\r\nIf you disable or do not configure this setting, the OneDrive sync app will preserve permission inheritance in read-only folders. Sync speed may be significantly slower.",
                    "categoryPath": "\\OneDrive",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "22fd2a9c-471e-4bbd-82e7-f778eb867c61",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Use OneDrive Files On-Demand",
                    "explainText": "This setting lets you control whether OneDrive Files On-Demand is enabled for your organization.\r\n\r\nIf you enable this setting, OneDrive Files On-Demand will be turned on by default.\r\n\r\nIf you disable this setting, OneDrive Files On-Demand will be explicitly disabled and users can\u0027t turn it on.\r\n\r\nIf you do not configure this setting, users can turn OneDrive Files On-Demand on or off.",
                    "categoryPath": "\\OneDrive",
                    "supportedOn": "At least Windows Server 2016, Windows 10 Version 1709",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "0de8c88e-9535-4d96-b6f7-52f56beaa2c5",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }
        ]
    }, {
        "@odata.type": "#microsoft.graph.groupPolicyConfiguration",
        "displayName": "Win10 Outlook Admin Templates",
        "description": "Configures Outlook policies for win10 devices",
        "roleScopeTagIds": ["0"],
        "definitionValues": [{
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Allow Outlook Autodiscover to interact with Office Config Service",
                    "explainText": "This policy setting determines whether Outlook can interact with the Office Config Service to get Autodiscover V2 service endpoint URL for different sovereigns.\r\n\r\nif you enable this policy setting, Outlook will get the URL for the sovereign Autodiscover v2 service endpoint by default.\r\n\r\nIf you disable this policy setting, Outlook will get the URL for the WW Autodiscover v2 service endpoint by default.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "4fae8da3-9762-408d-8de1-3db3e8f83e00",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Prevent personal Microsoft accounts from using MAPI",
                    "explainText": "This policy setting governs whether personal Microsoft accounts can be configured to use MAPI in Outlook.\r\n\r\nA personal Microsoft account is an account hosted on Outlook.com, Hotmail.com, Live.com, Msn.com or any variation on those domains.\r\n\r\nIf you enable this policy, users won’t be able to configure a personal Microsoft account to use MAPI in Outlook.\r\n\r\nThis means that in the Add Account dialog box in Outlook, users must choose “Manual setup or additional server types,” then choose Next, and then choose “POP or IMAP.”\r\n\r\nIf you disable or don’t configure this policy setting, users can configure a personal Microsoft account to use MAPI in Outlook. They can do this by choosing “E-mail” account in the Add Account dialog box.\r\n\r\nNote that personal Microsoft accounts that are configured to use MAPI will be automatically configured to use Cached Exchange Mode, and this can’t be changed.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "250be471-a800-4ae2-8caf-43d1ba8fcd27",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Set message format",
                    "explainText": "This policy setting controls the default message format in Outlook. \r\n\r\nIf you do not configure this policy setting, new e-mail messages in Outlook are formatted as HTML. \r\n\r\nIf you enable this policy setting, you can set the default e-mail format in Outlook to HTML, Rich Text, or plain text. Users can choose a format other than the default when composing messages. \r\n\r\nIf you disable this policy setting, Outlook uses HTML as the default e-mail format and users will not be able to change it. \r\n\r\nIf you do not configure this policy setting, Outlook uses HTML as the default e-mail format, but users can choose a format other than the default when composing messages.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Outlook Options\\Mail Format\\Internet Formatting\\Message Format",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "c9a8e6aa-a489-4f74-a0cc-e3b135832c6a",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "131072",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Use the following format for e-mail messages:",
                            "required": false,
                            "defaultItem": {
                                "displayName": "HTML",
                                "value": "131072"
                            },
                            "items": [{
                                    "displayName": "HTML",
                                    "value": "131072"
                                }, {
                                    "displayName": "Rich Text",
                                    "value": "196608"
                                }, {
                                    "displayName": "Plain Text",
                                    "value": "65536"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Use Cached Exchange Mode for new and existing Outlook profiles",
                    "explainText": "By default, users can choose to configure Cached Exchange Mode or use Online mode. By enabling this setting, new and existing Outlook profiles are configured to use Cached Exchange Mode. Disabling this setting configures new and existing Outlook profiles to use Online mode.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange\\Cached Exchange Mode",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "cb4b3d06-4e3b-493a-915b-10cef5347682",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Automatically configure profile based on Active Directory Primary SMTP address",
                    "explainText": "Automatically configure only the first profile based on Active Directory primary SMTP address\r\n\r\nThis policy setting controls whether users who are joined to a domain in an Active Directory environment can change the primary SMTP address that is used when they set up an account in Outlook.\r\n\r\nIf this policy setting is enabled, users can enter a profile name to create a new profile without using the new account wizard. A user interface does not appear as the profile is created.\r\n\r\nThis key will be ignored after the first profile has been successfully created.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "250be471-a800-4ae2-8caf-43d1ba8fcd27",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": false,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Prevent adding non-default Exchange accounts",
                    "explainText": "This policy allows you to prevent users from adding non-default Exchange accounts to existing Outlook profiles.\r\n\r\nIf you enable this policy setting, you will prevent users from adding non-default Exchange accounts via the Add New E-mail Account wizard.\r\n\r\nIf you disable or do not configure this policy setting, users can add non-default Exchange accounts to existing Outlook profiles.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "250be471-a800-4ae2-8caf-43d1ba8fcd27",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Make Outlook the default program for E-mail, Contacts, and Calendar",
                    "explainText": "This policy setting controls whether Outlook is the default program for e-mail, contacts, and calendar services.\r\n\r\nIf you enable this policy setting, the \"Make Outlook the default program for E-mail, Contacts, and Calendar\" check box on the General tab of the Office Center is selected and users cannot change it.\r\n\r\nIf you disable this policy setting, users cannot make Outlook the default program for these services.\r\n\r\nIf you do not configure this policy setting, Outlook is made the default program for e-mail, contacts, and calendar services when it is installed, although users can designate other programs as the default programs for these services.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Outlook Options\\Other",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "234e2d3c-ce59-4f72-8ec7-9d83932950a1",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Mail account options",
                    "explainText": "Send messages immediately when connected",
                    "categoryPath": "\\Microsoft Outlook 2016\\Outlook Options\\Mail Setup",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "0aacdf45-eb24-4f11-a5c7-f715e83c0656",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Cached Exchange Mode (File | Cached Exchange Mode)",
                    "explainText": "Specifies the default Cached Exchange Mode for new profiles and disables the download options in the Cached Exchange Mode command submenu in the File menu.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange\\Cached Exchange Mode",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "cb4b3d06-4e3b-493a-915b-10cef5347682",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "2",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Select Cached Exchange Mode for new profiles",
                            "required": false,
                            "defaultItem": {
                                "displayName": "Download Full Items",
                                "value": "2"
                            },
                            "items": [{
                                    "displayName": "Download Headers",
                                    "value": "1"
                                }, {
                                    "displayName": "Download Full Items",
                                    "value": "2"
                                }, {
                                    "displayName": "Download Headers and then Full Items",
                                    "value": "3"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Use the Online Global Address List for Nickname Resolution",
                    "explainText": "This policy setting allows you to force Outlook to use the Online Global Address List for ambiguous name resolution when composing messages in Outlook, instead of using the Offline Address Book when it is available.\r\n\r\nIf you enable this policy setting, addresses are resolved using the Online Global Address List, which may contain additional information (that the Offline Address Book would not have) that allows an address to be resolved.\r\n\r\nIf you disable or do not configure this policy setting, Outlook resolves addresses using the Offline Address Book when it is available.",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange\\Cached Exchange Mode",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "cb4b3d06-4e3b-493a-915b-10cef5347682",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "user",
                    "displayName": "Prefer the provided account email in AutoDiscover auth prompts.",
                    "explainText": "If set, this policy setting governs the displayed email in auth prompts related to AutoDiscover.\r\n\r\n        Default (0): Prefers the account UPN, when available.\r\n\r\n        If you enable this setting, then AutoDiscover auth prompts will prefer the provided account email (can be either SMTP or UPN depending on which was configured).",
                    "categoryPath": "\\Microsoft Outlook 2016\\Account Settings\\Exchange",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "aaa9c354-77be-44d3-a207-b279740bc5b4",
                    "minDeviceCspVersion": null,
                    "minUserCspVersion": "5.0",
                    "version": "1.0"
                },
                "presentationValues": null
            }
        ]
    }, {
        "@odata.type": "#microsoft.graph.groupPolicyConfiguration",
        "displayName": "Win10 Office Admin Templates",
        "description": "Configures Office policies for win10 devices",
        "roleScopeTagIds": ["0"],
        "definitionValues": [{
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Open Directly in Office Client Application",
                    "explainText": "This policy allows the admin to choose whether Office documents located on web servers open up directly in the App or go via the web browser",
                    "categoryPath": "\\Microsoft Office 2016 (Machine)\\Miscellaneous",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "094fe649-1d59-46e1-8a08-b7b30d1e2d76",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Enable Automatic Updates",
                    "explainText": "This policy setting controls whether the Office automatic updates are enabled or disabled for all Office products installed via Click-to-Run. This policy has no effect on Office products installed via Windows Installer. \r\n\r\nIf you enable or do not configure this policy setting, Office periodically checks for updates. When updates are detected, Office downloads and applies them in the background. \r\n\r\nIf you disable this policy setting, Office won\u0027t check for updates.",
                    "categoryPath": "\\Microsoft Office 2016 (Machine)\\Updates",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "8ef32cd6-ea68-4f8f-b72f-1eecb1546a73",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Default Office theme",
                    "explainText": "This policy setting allows you to select the user interface (UI) theme used by Office, if the user has not already selected an Office theme.\r\n\r\nNote: This setting only applies to Version 1903 or later of Office.\r\n\r\nIf you enable this policy setting, you may choose the Office theme used in cases where the user has not selected an Office theme themselves.\r\n\r\nIf you disable or do not configure this policy setting, Office will use the Colorful theme in cases where the user has not selected an Office theme themselves.\r\n\r\nRegardless of how you configure this policy setting, users can change their Office theme by going to File \u003e Account \u003e Office Theme (or, in Outlook, by going to File \u003e Office Account \u003e Office Theme).\r\n\r\nNote: This policy setting takes precedence over the “Default Office theme” policy setting located under User Configuration.",
                    "categoryPath": "\\Microsoft Office 2016 (Machine)\\Global Options\\Customize",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "b4bdc675-655e-4907-b0b5-5ad6bb65645f",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "3",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Theme:",
                            "required": false,
                            "defaultItem": {
                                "displayName": "Colorful",
                                "value": "0"
                            },
                            "items": [{
                                    "displayName": "Colorful",
                                    "value": "0"
                                }, {
                                    "displayName": "Dark Gray",
                                    "value": "3"
                                }, {
                                    "displayName": "Black",
                                    "value": "4"
                                }, {
                                    "displayName": "White",
                                    "value": "5"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Prevent users from running Microsoft Lync",
                    "explainText": "\r\nPrevents users from running Microsoft Lync.\r\n\r\nIf you enable this policy setting, users cannot run Microsoft Lync.\r\n\r\nIf you disable or do not configure this policy setting, users can run Microsoft Lync.\r\n\r\nNote: You can configure this policy setting under both Computer Configuration and User Configuration, but the policy setting under Computer Configuration takes precedence.\r\n      ",
                    "categoryPath": "\\Skype for Business 2016\\Microsoft Lync Feature Policies",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "8e6f4e61-06cd-46bc-a684-07b52ba9e1b0",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Update Channel",
                    "explainText": "This policy setting controls which update channel Office gets updates from when Office is configured to get updates directly from the Office Content Delivery Network (CDN).\r\n\r\nIf you enable this policy setting, Office gets updates from the update channel that you select.\r\n\r\nIf you disable or don\u0027t configure this policy setting, Office gets updates from its default channel, or by the update channel specified by the Office Deployment Tool. The default channel is determined by which Office product that is installed.\r\n\r\nImportant: This policy setting only applies to Office clients, such as Office 365 ProPlus, that come with an Office 365 plan. This policy setting also applies to Visio and Project products that come with an Office 365 plan. This policy has no effect on Office products that are installed by using Windows Installer (MSI).",
                    "categoryPath": "\\Microsoft Office 2016 (Machine)\\Updates",
                    "supportedOn": "At least Windows Server 2008 R2 or Windows 7",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": true,
                    "groupPolicyCategoryId": "8ef32cd6-ea68-4f8f-b72f-1eecb1546a73",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "Deferred",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Channel Name:",
                            "required": false,
                            "defaultItem": {
                                "displayName": "Monthly Channel",
                                "value": "Current"
                            },
                            "items": [{
                                    "displayName": "Monthly Channel",
                                    "value": "Current"
                                }, {
                                    "displayName": "Monthly Channel (Targeted)",
                                    "value": "FirstReleaseCurrent"
                                }, {
                                    "displayName": "Semi-Annual Channel",
                                    "value": "Deferred"
                                }, {
                                    "displayName": "Semi-Annual Channel (Targeted)",
                                    "value": "FirstReleaseDeferred"
                                }, {
                                    "displayName": "Insider Fast",
                                    "value": "InsiderFast"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }
        ]
    }, {
        "@odata.type": "#microsoft.graph.groupPolicyConfiguration",
        "displayName": "Win10 Edge Admin Templates",
        "description": "Configures Office policies for win10 devices",
        "roleScopeTagIds": ["0"],
        "definitionValues": [{
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Set new tab page quick links",
                    "explainText": "By default, Microsoft Edge displays quick links on the new tab page from user-added shortcuts and top sites based on browsing history. With this policy, you can configure up to three quick link tiles on the new tab page, expressed as a JSON object:\r\n\r\n[ { \"url\": \"https://www.contoso.com\", \"title\": \"Contoso Portal\", \"pinned\": true/false }, ... ]\r\n\r\nThe \u0027url\u0027 field is required; \u0027title\u0027 and \u0027pinned\u0027 are optional. If \u0027title\u0027 is not provided, the URL is used as the default title. If \u0027pinned\u0027 is not provided, the default value is false.\r\n\r\nMicrosoft Edge presents these in the order listed, from left to right, with all pinned tiles displayed ahead of non-pinned tiles.\r\n\r\nIf the policy is set as mandatory, the \u0027pinned\u0027 field will be ignored and all tiles will be pinned. The tiles can\u0027t be deleted by the user and will always appear at the front of the quick links list.\r\n\r\nIf the policy is set as recommended, pinned tiles will remain in the list but the user has the ability to edit and delete them. Quick link tiles that aren\u0027t pinned behave like default top sites and are pushed off the list if other websites are visited more frequently. When applying non-pinned links via this policy to an existing browser profile, the links may not appear at all, depending on how they rank compared to the user\u0027s browsing history.\r\n\r\nExample value:\r\n\r\n[\r\n  {\r\n    \"url\": \"https://contoso.com\", \r\n    \"pinned\": true, \r\n    \"title\": \"Contoso Portal\"\r\n  }, \r\n  {\r\n    \"url\": \"https://fabrikam.com\", \r\n    \"title\": \"Fabrikam\"\r\n  }\r\n]",
                    "categoryPath": "\\Microsoft Edge\\Startup, home page and new tab page",
                    "supportedOn": "Microsoft Edge version 79, Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f8985c7d-e21a-49e1-a65e-a0462ce48e89",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "[{\"url\":\"##AlyaWebPage##\",\"title\":\"##AlyaCompanyName##\",\"pinned\":true},{\"url\":\"https://google.ch\",\"title\":\"Google\",\"pinned\":true},{\"url\":\"https://portal.office.com\",\"title\":\"Office365\",\"pinned\":true},{\"url\":\"https://myaccount.microsoft.com\",\"title\":\"MyAccount\",\"pinned\":true}]",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Set new tab page quick links",
                            "defaultValue": "",
                            "required": false,
                            "maxLength": 1000000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Configure the new tab page search box experience",
                    "explainText": "You can configure the new tab page search box to use \"Search box (Recommended)\" or \"Address bar\" to search on new tabs. This policy only works if you set the search engine to a value other than Bing by setting the following two policies: \u0027DefaultSearchProviderEnabled\u0027 (Enable the default search provider) and \u0027DefaultSearchProviderSearchURL\u0027 (Default search provider search URL).\r\n\r\n If you disable or don\u0027t configure this policy and:\r\n\r\n- If the address bar default search engine is Bing, the new tab page uses the search box to search on new tabs.\r\n- If the address bar default search engine is not Bing, users are offered an additional choice (use \"Address bar\") when searching on new tabs.\r\n\r\n\r\nIf you enable this policy and set it to:\r\n\r\n- \"Search box (Recommended)\" (\u0027bing\u0027), the new tab page uses the search box to search on new tabs.\r\n- \"Address bar\" (\u0027redirect\u0027), the new tab page search box uses the address bar to search on new tabs.\r\n\r\nPolicy options mapping:\r\n\r\n* bing (bing) = Search box (Recommended)\r\n\r\n* redirect (redirect) = Address bar\r\n\r\nUse the preceding information when configuring this policy.\r\n\r\nExample value: bing",
                    "categoryPath": "\\Microsoft Edge\\Default search provider",
                    "supportedOn": "Microsoft Edge version 85, Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "b78327a1-5db6-4dc1-a43e-a05332da691b",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "redirect",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "New tab page search box experience",
                            "required": false,
                            "defaultItem": {
                                "displayName": "Search box (Recommended)",
                                "value": "bing"
                            },
                            "items": [{
                                    "displayName": "Search box (Recommended)",
                                    "value": "bing"
                                }, {
                                    "displayName": "Address bar",
                                    "value": "redirect"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Sites to open when the browser starts",
                    "explainText": "Specify a list of websites to open automatically when the browser starts. If you don\u0027t configure this policy, no site is opened on startup.\r\n\r\nThis policy only works if you also set the \u0027RestoreOnStartup\u0027 (Action to take on startup) policy to \u0027Open a list of URLs\u0027 (4).\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.\r\n\r\nExample value:\r\n\r\nhttps://contoso.com\r\nhttps://www.fabrikam.com",
                    "categoryPath": "\\Microsoft Edge\\Startup, home page and new tab page",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "6b96ca1a-d94a-4fa5-838d-bd849b3f6055",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueList",
                        "values": [{
                                "name": "##AlyaWebPage##",
                                "value": null
                            }, {
                                "name": "https://google.ch",
                                "value": null
                            }, {
                                "name": "https://portal.office.com",
                                "value": null
                            }
                        ],
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationListBox",
                            "label": "Sites to open when the browser starts",
                            "explicitValue": false,
                            "valuePrefix": ""
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Action to take on startup",
                    "explainText": "Specify how Microsoft Edge behaves when it starts.\r\n\r\nIf you want a new tab to always open on startup, choose \u0027RestoreOnStartupIsNewTabPage\u0027.\r\n\r\nIf you want to reopen URLs that were open the last time Microsoft Edge closed, choose \u0027RestoreOnStartupIsLastSession\u0027. The browsing session will be restored as it was. Note that this option disables some settings that rely on sessions or that perform actions on exit (such as Clear browsing data on exit or session-only cookies).\r\n\r\nIf you want to open a specific set of URLs, choose \u0027RestoreOnStartupIsURLs\u0027.\r\n\r\nDisabling this setting is equivalent to leaving it not configured. Users will be able to change it in Microsoft Edge.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.\r\n\r\nPolicy options mapping:\r\n\r\n* RestoreOnStartupIsNewTabPage (5) = Open a new tab\r\n\r\n* RestoreOnStartupIsLastSession (1) = Restore the last session\r\n\r\n* RestoreOnStartupIsURLs (4) = Open a list of URLs\r\n\r\nUse the preceding information when configuring this policy.",
                    "categoryPath": "\\Microsoft Edge\\Startup, home page and new tab page",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "6b96ca1a-d94a-4fa5-838d-bd849b3f6055",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "5",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Action to take on startup",
                            "required": false,
                            "defaultItem": {
                                "displayName": "Open a new tab",
                                "value": "5"
                            },
                            "items": [{
                                    "displayName": "Open a new tab",
                                    "value": "5"
                                }, {
                                    "displayName": "Restore the last session",
                                    "value": "1"
                                }, {
                                    "displayName": "Open a list of URLs",
                                    "value": "4"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": false,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Prevent Desktop Shortcut creation upon install default",
                    "explainText": "Lets you specify the default behavior for all channels for creating a desktop shortcut when Microsoft Edge is installed.\r\n\r\n  If you enable this policy a desktop shortcut is created when Microsoft Edge is installed.\r\n  If you disable this policy, no desktop shortcut will be created when Microsoft Edge is installed.\r\n  If you don’t configure this policy a desktop shortcut to Microsoft Edge will be created during installation.\r\n  If Microsoft Edge is already installed, this policy will have no effect.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications",
                    "supportedOn": "Microsoft Edge Update 1.3.128.0 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "4c66d751-c332-4849-8763-a3b0da1c5e98",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": false,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Allow installation",
                    "explainText": "Specifies whether a Microsoft Edge channel can be installed on domain-joined devices.\r\n\r\n  If you enable this policy for a channel, Microsoft Edge will not be blocked from installation.\r\n\r\n  If you disable this policy for a channel, Microsoft Edge will be blocked from installation.\r\n\r\n  If you don\u0027t configure this policy for a channel, the \u0027Allow installation default\u0027 policy configuration determines whether users can install that channel of Microsoft Edge.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications\\Microsoft Edge Beta",
                    "supportedOn": "Microsoft Edge Update 1.2.145.5 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "23a67686-8f0c-4926-b1d1-f0b0c7866316",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Allow installation",
                    "explainText": "Specifies whether a Microsoft Edge channel can be installed on domain-joined devices.\r\n\r\n  If you enable this policy for a channel, Microsoft Edge will not be blocked from installation.\r\n\r\n  If you disable this policy for a channel, Microsoft Edge will be blocked from installation.\r\n\r\n  If you don\u0027t configure this policy for a channel, the \u0027Allow installation default\u0027 policy configuration determines whether users can install that channel of Microsoft Edge.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications\\Microsoft Edge",
                    "supportedOn": "Microsoft Edge Update 1.2.145.5 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "d457d693-bd7a-479a-8660-b0f00e2cd9e5",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Configure the home page URL",
                    "explainText": "Configures the default home page URL in Microsoft Edge.\r\n\r\nThe home page is the page opened by the Home button. The pages that open on startup are controlled by the \u0027RestoreOnStartup\u0027 (Action to take on startup) policies.\r\n\r\nYou can either set a URL here or set the home page to open the new tab page. If you select to open the new tab page, then this policy doesn\u0027t take effect.\r\n\r\nIf you enable this policy, users can\u0027t change their home page URL, but they can choose to use the new tab page as their home page.\r\n\r\nIf you disable or don\u0027t configure this policy, users can choose their own home page, as long as the \u0027HomepageIsNewTabPage\u0027 (Set the new tab page as the home page) policy isn\u0027t enabled.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.\r\n\r\nExample value: https://www.contoso.com",
                    "categoryPath": "\\Microsoft Edge\\Startup, home page and new tab page",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "6b96ca1a-d94a-4fa5-838d-bd849b3f6055",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "##AlyaWebPage##",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Home page URL",
                            "defaultValue": "",
                            "required": false,
                            "maxLength": 1000000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Parameters for an image URL that uses POST",
                    "explainText": "If you enable this policy, it specifies the parameters used when an image search that uses POST is performed. The policy consists of comma-separated name/value pairs. If a value is a template parameter, like {imageThumbnail} in the preceding example, it\u0027s replaced with real image thumbnail data. This policy is applied only if you enable the \u0027DefaultSearchProviderEnabled\u0027 (Enable the default search provider) and \u0027DefaultSearchProviderSearchURL\u0027 (Default search provider search URL) policies.\r\n\r\nSpecify Bing\u0027s Image Search URL Post Params as:\r\n\u0027imageBin={google:imageThumbnailBase64}\u0027.\r\n\r\nSpecify Google\u0027s Image Search URL Post Params as:\r\n\u0027encoded_image={google:imageThumbnail},image_url={google:imageURL},sbisrc={google:imageSearchSource},original_width={google:imageOriginalWidth},original_height={google:imageOriginalHeight}\u0027.\r\n\r\nIf you don\u0027t set this policy, image search requests are sent using the GET method.\r\n\r\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \u0027ManagedSearchEngines\u0027 (Manage Search Engines) policy.\r\n\r\nExample value: content={imageThumbnail},url={imageURL},sbisrc={SearchSource}",
                    "categoryPath": "\\Microsoft Edge\\Default search provider",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f37c10c3-c3dc-4840-8e3a-d7e75457db5c",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "encoded_image={google:imageThumbnail},image_url={google:imageURL},sbisrc={google:imageSearchSource},original_width={google:imageOriginalWidth},original_height={google:imageOriginalHeight}",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Parameters for an image URL that uses POST",
                            "defaultValue": "",
                            "required": false,
                            "maxLength": 1000000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": false,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Allow installation",
                    "explainText": "Specifies whether a Microsoft Edge channel can be installed on domain-joined devices.\r\n\r\n  If you enable this policy for a channel, Microsoft Edge will not be blocked from installation.\r\n\r\n  If you disable this policy for a channel, Microsoft Edge will be blocked from installation.\r\n\r\n  If you don\u0027t configure this policy for a channel, the \u0027Allow installation default\u0027 policy configuration determines whether users can install that channel of Microsoft Edge.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications\\Microsoft Edge Canary",
                    "supportedOn": "Microsoft Edge Update 1.2.145.5 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "77e7abfc-5602-41b8-99d1-a77e1f9fa765",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Configure the Microsoft Edge new tab page experience (deprecated)",
                    "explainText": "DEPRECATED: This policy is deprecated. It is currently supported but will become obsolete in a future release.\r\n\r\nWe are deprecating this policy because the new version of the enterprise new tab page no longer requires choosing between different content types. Instead, the content that is presented to the user can be controlled via the Microsoft 365 admin center. To get to the Microsoft 365 admin center, sign in at https://admin.microsoft.com with your admin account. The policy will be made obsolete after Microsoft Edge version 90.\r\n\r\nLets you choose either the Microsoft News or Office 365 feed experience for the new tab page.\r\n\r\nWhen you set this policy to \u0027News\u0027, users will see the Microsoft News feed experience on the new tab page.\r\n\r\nWhen you set this policy to \u0027Office\u0027, users with an Azure Active Directory browser sign-in will see the Office 365 feed experience on the new tab page.\r\n\r\nIf you disable or don\u0027t configure this policy:\r\n\r\n- Users with an Azure Active Directory browser sign-in are offered the Office 365 new tab page feed experience, as well as the standard new tab page feed experience.\r\n\r\n- Users without an Azure Active Directory browser sign-in will see the standard new tab page experience.\r\n\r\nIf you configure this policy *and* the \u0027NewTabPageLocation\u0027 (Configure the new tab page URL) policy, \u0027NewTabPageLocation\u0027 has precedence.\r\n\r\nDefault setting:  Disabled or not configured.\r\n\r\nPolicy options mapping:\r\n\r\n* News (0) = Microsoft News feed experience\r\n\r\n* Office (1) = Office 365 feed experience\r\n\r\nUse the preceding information when configuring this policy.",
                    "categoryPath": "\\Microsoft Edge\\Startup, home page and new tab page",
                    "supportedOn": "Microsoft Edge version 79, Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f8985c7d-e21a-49e1-a65e-a0462ce48e89",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "1",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "New tab page experience",
                            "required": false,
                            "defaultItem": {
                                "displayName": "Microsoft News feed experience",
                                "value": "0"
                            },
                            "items": [{
                                    "displayName": "Microsoft News feed experience",
                                    "value": "0"
                                }, {
                                    "displayName": "Office 365 feed experience",
                                    "value": "1"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": false,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Allow installation",
                    "explainText": "Specifies whether a Microsoft Edge channel can be installed on domain-joined devices.\r\n\r\n  If you enable this policy for a channel, Microsoft Edge will not be blocked from installation.\r\n\r\n  If you disable this policy for a channel, Microsoft Edge will be blocked from installation.\r\n\r\n  If you don\u0027t configure this policy for a channel, the \u0027Allow installation default\u0027 policy configuration determines whether users can install that channel of Microsoft Edge.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications\\Microsoft Edge Dev",
                    "supportedOn": "Microsoft Edge Update 1.2.145.5 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "fda731c5-1199-4c07-9ac1-52c1c67f003b",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": false,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Allow Microsoft Edge Side by Side browser experience",
                    "explainText": "This policy lets a user run Microsoft Edge (Edge HTML) and Microsoft Edge (Chromium-based) side-by-side.\r\n\r\nIf this policy is set to “Not configured”, Microsoft Edge (Chromium-based) will replace Microsoft Edge (Edge HTML) after the Microsoft Edge (Chromium-based) stable channel and the November 2019 security updates are installed.  This is the same behavior as the “Disabled” setting.\r\n\r\nThe “Disabled” setting blocks a side-by-side experience and Microsoft Edge (Chromium-based) will replace Microsoft Edge (Edge HTML) after the Microsoft Edge (Chromium-based) stable channel and the November 2019 security updates are installed.  This is the same behavior as the “Not Configured” setting.\r\n\r\nWhen this policy is “Enabled”, Microsoft Edge (Chromium-based) and Microsoft Edge (Edge HTML) can run side-by-side after Microsoft Edge (Chromium-based) is installed.\r\n\r\nFor this group policy to take affect, it must be configured before the automatic install of Microsoft Edge (Chromium-based) by Windows Update. Note: ​A user can block the automatic update of Microsoft Edge (Chromium-based) by using the Microsoft Edge (Chromium-based) Blocker Toolkit.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications",
                    "supportedOn": "Microsoft Edge Update 1.2.145.5 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "896f241c-2cfe-4c72-9fbc-667c95a87f8d",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Default search provider name",
                    "explainText": "Specifies the name of the default search provider.\r\n\r\nIf you enable this policy, you set the name of the default search provider.\r\n\r\nIf you don\u0027t enable this policy or if you leave it empty, the host name specified by the search URL is used.\r\n\r\n\u0027DefaultSearchProviderName\u0027 should be set to an organization-approved encrypted search provider that corresponds to the encrypted search provider set in DTBC-0008. This policy is applied only if you enable the \u0027DefaultSearchProviderEnabled\u0027 (Enable the default search provider) and \u0027DefaultSearchProviderSearchURL\u0027 (Default search provider search URL) policies.\r\n\r\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \u0027ManagedSearchEngines\u0027 (Manage Search Engines) policy.\r\n\r\nExample value: My Intranet Search",
                    "categoryPath": "\\Microsoft Edge\\Default search provider",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f37c10c3-c3dc-4840-8e3a-d7e75457db5c",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "Google",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Default search provider name",
                            "defaultValue": "",
                            "required": false,
                            "maxLength": 1000000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Configure Microsoft Defender SmartScreen",
                    "explainText": "This policy setting lets you configure whether to turn on Microsoft Defender SmartScreen. Microsoft Defender SmartScreen provides warning messages to help protect your users from potential phishing scams and malicious software. By default, Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you enable this setting, Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you disable this setting, Microsoft Defender SmartScreen is turned off.\r\n\r\nIf you don\u0027t configure this setting, users can choose whether to use Microsoft Defender SmartScreen.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX.",
                    "categoryPath": "\\Microsoft Edge\\SmartScreen settings",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "177328b2-6597-4c06-a985-ff758a41b9a3",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Show Home button on toolbar",
                    "explainText": "Shows the Home button on Microsoft Edge\u0027s toolbar.\r\n\r\nEnable this policy to always show the Home button. Disable it to never show the button.\r\n\r\nIf you don\u0027t configure the policy, users can choose whether to show the home button.",
                    "categoryPath": "\\Microsoft Edge\\Startup, home page and new tab page",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "6b96ca1a-d94a-4fa5-838d-bd849b3f6055",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Enable the default search provider",
                    "explainText": "Enables the ability to use a default search provider.\r\n\r\nIf you enable this policy, a user can search for a term by typing in the address bar (as long as what they type isn\u0027t a URL).\r\n\r\nYou can specify the default search provider to use by enabling the rest of the default search policies. If these are left empty (not configured) or configured incorrectly, the user can choose the default provider.\r\n\r\nIf you disable this policy, the user can\u0027t search from the address bar.\r\n\r\nIf you enable or disable this policy, users can\u0027t change or override it.\r\n\r\nIf you don\u0027t configure this policy, the default search provider is enabled, and the user can choose the default search provider and set the search provider list.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain, Windows 10 Pro or Enterprise instances that enrolled for device management, or macOS instances that are that are managed via MDM or joined to a domain via MCX..\r\n\r\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy.",
                    "categoryPath": "\\Microsoft Edge\\Default search provider",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f37c10c3-c3dc-4840-8e3a-d7e75457db5c",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Default search provider keyword",
                    "explainText": "Specifies the keyword, which is the shortcut used in the Address Bar to trigger the search for this provider.\r\n\r\nThis policy is optional. If you don\u0027t configure it, no keyword activates the search provider.\r\n\r\nThis policy is applied only if you enable the \u0027DefaultSearchProviderEnabled\u0027 (Enable the default search provider) and \u0027DefaultSearchProviderSearchURL\u0027 (Default search provider search URL) policies.\r\n\r\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \u0027ManagedSearchEngines\u0027 (Manage Search Engines) policy.\r\n\r\nExample value: mis",
                    "categoryPath": "\\Microsoft Edge\\Default search provider",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f37c10c3-c3dc-4840-8e3a-d7e75457db5c",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "google",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Default search provider keyword",
                            "defaultValue": "",
                            "required": false,
                            "maxLength": 1000000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Default search provider search URL",
                    "explainText": "Specifies the URL of the search engine used for a default search. The URL contains the string \u0027{searchTerms}\u0027, which is replaced at query time by the terms the user is searching for.\r\n\r\nSpecify Bing\u0027s search URL as:\r\n\r\n\u0027{bing:baseURL}search?q={searchTerms}\u0027.\r\n\r\nSpecify Google\u0027s search URL as: \u0027{google:baseURL}search?q={searchTerms}\u0026{google:RLZ}{google:originalQueryForSuggestion}{google:assistedQueryStats}{google:searchFieldtrialParameter}{google:searchClient}{google:sourceId}ie={inputEncoding}\u0027.\r\n\r\nThis policy is required when you enable the \u0027DefaultSearchProviderEnabled\u0027 (Enable the default search provider) policy; if you don\u0027t enable the latter policy, this policy is ignored.\r\n\r\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \u0027ManagedSearchEngines\u0027 (Manage Search Engines) policy.\r\n\r\nExample value: https://search.contoso.com/search?q={searchTerms}",
                    "categoryPath": "\\Microsoft Edge\\Default search provider",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f37c10c3-c3dc-4840-8e3a-d7e75457db5c",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "https://www.google.ch/search?q={searchTerms}\u0026{google:RLZ}{google:originalQueryForSuggestion}{google:assistedQueryStats}{google:searchFieldtrialParameter}{google:searchClient}{google:sourceId}ie={inputEncoding}",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Default search provider search URL",
                            "defaultValue": "",
                            "required": false,
                            "maxLength": 1000000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Allow installation default",
                    "explainText": "You can specify the default behavior of all channels to allow or block Microsoft Edge on domain-joined devices.\r\n\r\nYou can override this policy for individual channels by enabling the \u0027Allow installation\u0027 policy for specific channels.\r\n\r\nIf you disable this policy, the installation of Microsoft Edge is blocked. This only affects the installation of Microsoft Edge software when the \u0027Allow installation\u0027 policy is set to Not Configured.\r\n\r\nThis policy doesn\u0027t prevent Microsoft Edge Update from running or prevent users from installing Microsoft Edge software using other methods.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications",
                    "supportedOn": "Microsoft Edge Update 1.2.145.5 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "09ed5361-786c-4fca-937d-9757aa7690f2",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Set the system default printer as the default printer",
                    "explainText": "Tells Microsoft Edge to use the system default printer as the default choice in Print Preview instead of the most recently used printer.\r\n\r\nIf you disable this policy or don\u0027t configure it, Print Preview uses the most recently used printer as the default destination choice.\r\n\r\nIf you enable this policy, Print Preview uses the OS system default printer as the default destination choice.",
                    "categoryPath": "\\Microsoft Edge\\Printing",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "9ec86c7e-361a-43dc-8c9f-707d2510ddc9",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": null
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Update policy override default",
                    "explainText": "Lets you specify the default behavior for all channels concerning the way Microsoft Edge Update handles available updates for Microsoft Edge. Can be overridden for individual channels by specifying the \u0027Update policy override\u0027 policy for those specific channels.\r\n\r\n  If you enable this policy, Microsoft Edge Update handles Microsoft Edge updates according to how you configure the following options:\r\n   - Always allow updates: Updates are always applied when found, either by periodic update check or by a manual update check.\r\n   - Automatic silent updates only: Updates are applied only when they\u0027re found by the periodic update check.\r\n   - Manual updates only: Updates are applied only when the user runs a manual update check.\r\n   - Updates disabled: Updates are never applied.\r\n\r\n  If you select manual updates, make sure you periodically check for updates by using the app\u0027s manual update mechanism, if available. If you disable updates, periodically check for updates, and distribute them to users.\r\n\r\n  If you don\u0027t enable and configure this policy, Microsoft Edge Update handles available updates as specified by the \u0027Update policy override\u0027 policy.",
                    "categoryPath": "\\Microsoft Edge Update\\Applications",
                    "supportedOn": "Microsoft Edge Update 1.2.145.5 and later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "09ed5361-786c-4fca-937d-9757aa7690f2",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "1",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationDropdownList",
                            "label": "Policy",
                            "required": true,
                            "defaultItem": {
                                "displayName": "Always allow updates (recommended)",
                                "value": "1"
                            },
                            "items": [{
                                    "displayName": "Always allow updates (recommended)",
                                    "value": "1"
                                }, {
                                    "displayName": "Manual updates only",
                                    "value": "2"
                                }, {
                                    "displayName": "Automatic silent updates only",
                                    "value": "3"
                                }, {
                                    "displayName": "Updates disabled",
                                    "value": "0"
                                }
                            ]
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }, {
                "@odata.type": "#microsoft.graph.groupPolicyDefinitionValue",
                "enabled": true,
                "configurationType": "policy",
                "definition": {
                    "@odata.context": "https://graph.microsoft.com/beta/$metadata#microsoft.graph.groupPolicyDefinition",
                    "classType": "machine",
                    "displayName": "Specifies the search-by-image feature for the default search provider",
                    "explainText": "Specifies the URL to the search engine used for image search. Search requests are sent using the GET method.\r\n\r\nThis policy is optional. If you don\u0027t configure it, image search isn\u0027t available.\r\n\r\nSpecify Bing\u0027s Image Search URL as:\r\n\u0027{bing:baseURL}images/detail/search?iss=sbiupload\u0026FORM=ANCMS1#enterInsights\u0027.\r\n\r\nSpecify Google\u0027s Image Search URL as: \u0027{google:baseURL}searchbyimage/upload\u0027.\r\n\r\nSee \u0027DefaultSearchProviderImageURLPostParams\u0027 (Parameters for an image URL that uses POST) policy to finish configuring image search.\r\n\r\nThis policy is applied only if you enable the \u0027DefaultSearchProviderEnabled\u0027 (Enable the default search provider) and \u0027DefaultSearchProviderSearchURL\u0027 (Default search provider search URL) policies.\r\n\r\nStarting in Microsoft Edge 84, you can set this policy as a recommended policy. If the user has already set a default search provider, the default search provider configured by this recommended policy will not be added to the list of search providers the user can choose from. If this is the desired behavior, use the \u0027ManagedSearchEngines\u0027 (Manage Search Engines) policy.\r\n\r\nExample value: https://search.contoso.com/searchbyimage/upload",
                    "categoryPath": "\\Microsoft Edge\\Default search provider",
                    "supportedOn": "Microsoft Windows 7 or later",
                    "policyType": "admxIngested",
                    "hasRelatedDefinitions": false,
                    "groupPolicyCategoryId": "f37c10c3-c3dc-4840-8e3a-d7e75457db5c",
                    "minDeviceCspVersion": "5.0",
                    "minUserCspVersion": null,
                    "version": "1.0"
                },
                "presentationValues": [{
                        "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText",
                        "value": "https://www.google.ch/searchbyimage/upload",
                        "presentation": {
                            "@odata.type": "#microsoft.graph.groupPolicyPresentationTextBox",
                            "label": "Specifies the search-by-image feature for the default search provider",
                            "defaultValue": "",
                            "required": false,
                            "maxLength": 1000000
                        },
                        "definition": "",
                        "definitionNext": "",
                        "definitionPrev": "",
                        "categories": null,
                        "files": null,
                        "presentations": null
                    }
                ]
            }
        ]
    }
]
