{
    {
		"@odata.type":  "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
        "roleScopeTagIds": ["0"],
        "description": "Configures kiosk mode on company owned android devices",
        "displayName": "Android Enterprise Owned Edge Kiosk Settings",
		"accountsBlockModification":  true,
		"appsAllowInstallFromUnknownSources":  null,
		"appsAutoUpdatePolicy":  "always",
		"appsDefaultPermissionPolicy":  null,
		"appsRecommendSkippingFirstUseHints":  true,
		"bluetoothBlockConfiguration":  true,
		"bluetoothBlockContactSharing":  null,
		"cameraBlocked":  null,
		"cellularBlockWiFiTethering":  true,
		"certificateCredentialConfigurationDisabled":  null,
		"microsoftLauncherConfigurationEnabled":  null,
		"microsoftLauncherCustomWallpaperEnabled":  null,
		"microsoftLauncherCustomWallpaperImageUrl":  null,
		"microsoftLauncherCustomWallpaperAllowUserModification":  null,
		"microsoftLauncherFeedEnabled":  null,
		"microsoftLauncherFeedAllowUserModification":  null,
		"microsoftLauncherDockPresenceConfiguration":  null,
		"microsoftLauncherDockPresenceAllowUserModification":  null,
		"microsoftLauncherSearchBarPlacementConfiguration":  null,
		"enrollmentProfile":  "dedicatedDevice",
		"dataRoamingBlocked":  true,
		"dateTimeConfigurationBlocked":  true,
		"factoryResetDeviceAdministratorEmails": [ ],
		"factoryResetBlocked":  false,
		"globalProxy":  null,
		"googleAccountsBlocked":  true,
		"kioskCustomizationDeviceSettingsBlocked":  true,
		"kioskCustomizationPowerButtonActionsBlocked":  false,
		"kioskCustomizationStatusBar":  "notConfigured",
		"kioskCustomizationSystemErrorWarnings":  null,
		"kioskCustomizationSystemNavigation":  "notConfigured",
		"kioskModeScreenSaverConfigurationEnabled":  null,
		"kioskModeScreenSaverImageUrl":  null,
		"kioskModeScreenSaverDisplayTimeInSeconds":  null,
		"kioskModeScreenSaverStartDelayInSeconds":  null,
		"kioskModeScreenSaverDetectMediaDisabled":  null,
		"kioskModeWallpaperUrl":  null,
		"kioskModeExitCode":  null,
		"kioskModeVirtualHomeButtonEnabled":  null,
		"kioskModeVirtualHomeButtonType":  "notConfigured",
		"kioskModeBluetoothConfigurationEnabled":  null,
		"kioskModeWiFiConfigurationEnabled":  null,
		"kioskModeFlashlightConfigurationEnabled":  null,
		"kioskModeMediaVolumeConfigurationEnabled":  null,
		"kioskModeShowDeviceInfo":  null,
		"kioskModeManagedSettingsEntryDisabled":  null,
		"kioskModeDebugMenuEasyAccessEnabled":  null,
		"kioskModeShowAppNotificationBadge":  null,
		"kioskModeScreenOrientation":  "notConfigured",
		"kioskModeIconSize":  "notConfigured",
		"kioskModeFolderIcon":  "notConfigured",
		"kioskModeWifiAllowedSsids": [ ],
		"kioskModeAppOrderEnabled":  null,
		"kioskModeAppsInFolderOrderedByName":  null,
		"kioskModeGridHeight":  null,
		"kioskModeGridWidth":  null,
		"kioskModeLockHomeScreen":  null,
		"microphoneForceMute":  null,
		"networkEscapeHatchAllowed":  null,
		"nfcBlockOutgoingBeam":  true,
		"passwordBlockKeyguard":  true,
		"passwordBlockKeyguardFeatures": [ ],
		"passwordExpirationDays":  null,
		"passwordMinimumLength":  null,
		"passwordMinimumLetterCharacters":  null,
		"passwordMinimumLowerCaseCharacters":  null,
		"passwordMinimumNonLetterCharacters":  null,
		"passwordMinimumNumericCharacters":  null,
		"passwordMinimumSymbolCharacters":  null,
		"passwordMinimumUpperCaseCharacters":  null,
		"passwordMinutesOfInactivityBeforeScreenTimeout":  10,
		"passwordPreviousPasswordCountToBlock":  null,
		"passwordRequiredType":  "deviceDefault",
		"passwordSignInFailureCountBeforeFactoryReset":  null,
		"playStoreMode":  null,
		"safeBootBlocked":  true,
		"screenCaptureBlocked":  true,
		"securityAllowDebuggingFeatures":  null,
		"securityRequireVerifyApps":  true,
		"statusBarBlocked":  false,
		"stayOnModes": [ ],
		"storageAllowUsb":  null,
		"storageBlockExternalMedia":  true,
		"storageBlockUsbFileTransfer":  true,
		"systemUpdateWindowStartMinutesAfterMidnight":  null,
		"systemUpdateWindowEndMinutesAfterMidnight":  null,
		"systemUpdateInstallType":  "automatic",
		"systemWindowsBlocked":  true,
		"usersBlockAdd":  true,
		"usersBlockRemove":  true,
		"volumeBlockAdjustment":  null,
		"vpnAlwaysOnLockdownMode":  false,
		"vpnAlwaysOnPackageIdentifier":  "",
		"wifiBlockEditConfigurations":  true,
		"wifiBlockEditPolicyDefinedConfigurations":  false,
		"personalProfileAppsAllowInstallFromUnknownSources":  null,
		"personalProfileCameraBlocked":  null,
		"personalProfileScreenCaptureBlocked":  null,
		"workProfilePasswordExpirationDays":  null,
		"workProfilePasswordMinimumLength":  null,
		"workProfilePasswordMinimumNumericCharacters":  null,
		"workProfilePasswordMinimumNonLetterCharacters":  null,
		"workProfilePasswordMinimumLetterCharacters":  null,
		"workProfilePasswordMinimumLowerCaseCharacters":  null,
		"workProfilePasswordMinimumUpperCaseCharacters":  null,
		"workProfilePasswordMinimumSymbolCharacters":  null,
		"workProfilePasswordPreviousPasswordCountToBlock":  null,
		"workProfilePasswordSignInFailureCountBeforeFactoryReset":  null,
		"workProfilePasswordRequiredType":  "deviceDefault",
		"kioskModeApps":  [
							{
								"name":  "com.microsoft.emmx",
								"publisher":  null,
								"appStoreUrl":  null,
								"appId":  "com.microsoft.emmx"
							}
						],
		"kioskModeManagedFolders": [ ],
		"kioskModeAppPositions": [ ]
    }
}
