{
    {
        "@odata.type": "#microsoft.graph.androidWorkProfileCustomConfiguration",
        "roleScopeTagIds": ["0"],
        "description": "Configures wlan settings on android devices",
        "displayName": "Android WLAN Settings",
        "omaSettings": [{
                "@odata.type": "#microsoft.graph.omaSettingString",
                "displayName": "CorpWLANSettings",
                "description": null,
                "omaUri": "./Vendor/MSFT/WiFi/Profile/CorpWLAN/Settings",
                "isEncrypted": false,
                "value": "\u003cWLANProfile\nxmlns=\"http://www.microsoft.com/networking/WLAN/profile/v1\"\u003e\n  \u003cname\u003eCorpWLAN\u003c/name\u003e\n  \u003cSSIDConfig\u003e\n    \u003cSSID\u003e\n      \u003chex\u003e48482d4d6f62696c65\u003c/hex\u003e\n      \u003cname\u003eCorpWLAN\u003c/name\u003e\n    \u003c/SSID\u003e\n    \u003cnonBroadcast\u003etrue\u003c/nonBroadcast\u003e\n  \u003c/SSIDConfig\u003e\n  \u003cconnectionType\u003eESS\u003c/connectionType\u003e\n  \u003cconnectionMode\u003eauto\u003c/connectionMode\u003e\n  \u003cautoSwitch\u003efalse\u003c/autoSwitch\u003e\n  \u003cMSM\u003e\n    \u003csecurity\u003e\n      \u003cauthEncryption\u003e\n        \u003cauthentication\u003eWPA2PSK\u003c/authentication\u003e\n        \u003cencryption\u003eAES\u003c/encryption\u003e\n        \u003cuseOneX\u003efalse\u003c/useOneX\u003e\n      \u003c/authEncryption\u003e\n      \u003csharedKey\u003e\n        \u003ckeyType\u003epassPhrase\u003c/keyType\u003e\n        \u003cprotected\u003efalse\u003c/protected\u003e\n        \u003ckeyMaterial\u003PleaseSpecify\u003c/keyMaterial\u003e\n      \u003c/sharedKey\u003e\n      \u003ckeyIndex\u003e0\u003c/keyIndex\u003e\n    \u003c/security\u003e\n  \u003c/MSM\u003e\n\u003c/WLANProfile\u003e"
            }
        ]
    },
	{
        "@odata.type":  "#microsoft.graph.androidDeviceOwnerWiFiConfiguration",
        "roleScopeTagIds": ["0"],
        "description": "Configures wlan settings on company owned android devices",
        "displayName": "Android Enterprise Owned WLAN Settings",
		"networkName":  "CorpWLAN",
		"ssid":  "CorpWLAN",
		"connectAutomatically":  true,
		"connectWhenNetworkNameIsHidden":  false,
		"wiFiSecurityType":  "wpaPersonal",
		"preSharedKey":  null,
		"preSharedKeyIsSet":  false
    },
	{
		"@odata.type":  "#microsoft.graph.iosWiFiConfiguration",
        "roleScopeTagIds": ["0"],
        "description": "Configures wlan settings on ios devices",
		"displayName":  "iOS WLAN Settings",
		"networkName":  "CorpWLAN",
		"ssid":  "CorpWLAN",
		"connectAutomatically":  true,
		"connectWhenNetworkNameIsHidden":  false,
		"wiFiSecurityType":  "wpaPersonal",
		"proxySettings":  "none",
		"proxyManualAddress":  null,
		"proxyManualPort":  null,
		"proxyAutomaticConfigurationUrl":  null,
		"disableMacAddressRandomization":  null,
		"preSharedKey":  null
	}
}
