{
    "@odata.type":  "#microsoft.graph.win32LobApp",
    "displayName":  "Win10 LocalCUS",
    "description":  "Installs Local Customer Resources",
    "publisher":  "Alya Consulting",
    "largeIcon":  {
                      "value":  "",
                      "type":  "image/png",
                      "@odata.type":  "#microsoft.graph.mimeContent"
                  },
    "isFeatured":  false,
    "privacyInformationUrl":  "https://alyaconsulting.ch/Home/Privacy",
    "informationUrl":  "https://alyaconsulting.ch",
    "owner":  "",
    "developer":  "Konrad Brunner",
    "notes":  "",
    "roleScopeTagIds":  [

                        ],
    "fileName":  "Install.intunewin",
    "installCommandLine":  "Install.cmd",
    "uninstallCommandLine":  "Uninstall.cmd",
    "applicableArchitectures":  "x64",
    "minimumFreeDiskSpaceInMB":  250,
    "minimumMemoryInMB":  100,
    "minimumNumberOfProcessors":  1,
    "minimumCpuSpeedInMHz":  1,
    "msiInformation":  null,
    "setupFilePath":  "Install.cmd",
    "installLanguage":  null,
    "minimumSupportedWindowsRelease":  "1607",
    "minimumSupportedOperatingSystem":  {
                                            "v8_0":  false,
                                            "v8_1":  false,
                                            "v10_0":  false,
                                            "v10_1607":  true,
                                            "v10_1703":  false,
                                            "v10_1709":  false,
                                            "v10_1803":  false,
                                            "v10_1809":  false,
                                            "v10_1903":  false
                                        },
    "detectionRules":  [
                           {
                               "@odata.type":  "#microsoft.graph.win32LobAppRegistryDetection",
                               "check32BitOn64System":  false,
                               "keyPath":  "Computer\\HKEY_LOCAL_MACHINE\\SOFTWARE\\AlyaConsulting\\Intune\\Win32AppVersions",
                               "valueName":  "LocalCUS",
                               "detectionType":  "version",
                               "operator":  "greaterThanOrEqual",
                               "detectionValue":  "1.1"
                           }
                       ],
    "requirementRules":  [

                         ],
    "rules":  [
                  {
                      "@odata.type":  "#microsoft.graph.win32LobAppRegistryRule",
                      "ruleType":  "detection",
                      "check32BitOn64System":  false,
                      "keyPath":  "Computer\\HKEY_LOCAL_MACHINE\\SOFTWARE\\AlyaConsulting\\Intune\\Win32AppVersions",
                      "valueName":  "LocalCUS",
                      "operationType":  "version",
                      "operator":  "greaterThanOrEqual",
                      "comparisonValue":  "1.1"
                  }
              ],
    "installExperience":  {
                              "runAsAccount":  "system",
                              "deviceRestartBehavior":  "suppress"
                          },
    "returnCodes":  [
                        {
                            "returnCode":  -1,
                            "type":  "failed"
                        },
                        {
                            "returnCode":  0,
                            "type":  "success"
                        },
                        {
                            "returnCode":  1707,
                            "type":  "success"
                        },
                        {
                            "returnCode":  3010,
                            "type":  "softReboot"
                        },
                        {
                            "returnCode":  1641,
                            "type":  "hardReboot"
                        },
                        {
                            "returnCode":  1618,
                            "type":  "retry"
                        }
                    ]
}
